{"meta":{"title":"贰十一万","subtitle":null,"description":null,"author":"贰十一万","url":"http://21w.space"},"pages":[{"title":"作为人的人存在","date":"2017-04-14T12:25:53.952Z","updated":"2017-04-14T12:24:11.070Z","comments":true,"path":"assets/Top.html","permalink":"http://21w.space/assets/Top.html","excerpt":"","text":""},{"title":"Links","date":"2017-02-12T12:19:00.000Z","updated":"2017-04-14T12:26:10.900Z","comments":false,"path":"links/index.html","permalink":"http://21w.space/links/index.html","excerpt":"","text":"MIA一肩月光PINK蔡剑锋"},{"title":"","date":"2017-04-14T09:56:20.479Z","updated":"2016-12-17T01:48:11.659Z","comments":true,"path":"loveyou/1.html","permalink":"http://21w.space/loveyou/1.html","excerpt":"","text":"html body{overflow：hidden;margin: 0;display: block;} body{ font-family: 'Open-Sans','Helvetica Neue','Hiragino Sans GB','LiHei Pro',Arial,Sans-serif; } #wrapper{ position: absolute; width: 400px; margin-left: -210px; margin-top: -150px; top: 50%; left: 50%; text-align: center; -webkit-user-select: none; -moz-user-select: none; user-select: none; } h1{ /*font-family: 'Open-Sans','Helvetica Neue','Hiragino Sans GB','LiHei Pro',Arial,Sans-serif;*/ font-family: 'Montserrat','Helvetica Neue',Arial,Sans-serif; font-weight: 700; font-size: 30px; letter-spacing: 9px; text-transform: uppercase; margin: 12px; } h2{ color: #999; font-weight: normal; font-size: 16px; letter-spacing: .11em; margin-bottom: 30px; left: 3px; } h1 h2{ position: relative; } p{margin: 0;} a{ font-size: 14px; line-height: 2em; margin: 0; letter-spacing: 2px; color: #999; text-decoration: none; } canvas{position: absolute;pointer-events: none; top: 0; left: 0; z-index: 0; width: 100%; height: 100%;} love You Who came to me when the world was gone&#63; I find thee I'm Safe &amp;Strong &amp;Glad 致某某 // document.addEventListener('touchmove', function (e) {e.preventDefault()}) var canvas = document.getElementById('canvas'); if (canvas.getContext){ var ctx = canvas.getContext('2d'); var dpr = window.devicePixelRatio || 1; var width = window.innerWidth; var height = window.innerHeight; var f = 90; var q; var color = 0; var m = Math; var pi = m.PI*2; var v = m.cos; var rand = m.random; canvas.width = width*dpr; canvas.height = height*dpr; ctx.scale(dpr, dpr); ctx.globalAlpha = 0.4; } function i(){ ctx.clearRect(0,0,width,height); random=rand()*0.4*height+0.3*height; q=[{x:0,y:random},{x:0,y:random+height*.15}]; while(q[1].x -1 && u.indexOf('KHTML') == -1, //火狐内核 mobile: !!u.match(/AppleWebKit.*Mobile.*/), //是否为移动终端 ios: !!u.match(/\\(i[^;]+;( U;)? CPU.+Mac OS X/), //ios终端 android: u.indexOf('Android') > -1 || u.indexOf('Linux') > -1, //android终端或者uc浏览器 iPhone: u.indexOf('iPhone') > -1 || u.indexOf('Mac') > -1, //是否为iPhone或者安卓QQ浏览器 iPad: u.indexOf('iPad') > -1, //是否为iPad webApp: u.indexOf('Safari') == -1 ,//是否为web应用程序，没有头部与底部 weixin: u.indexOf('MicroMessenger') == -1 //是否为微信浏览器 }; } var browser ={versions:dev()}; if(browser.versions.mobile === true){ document.ontouchstart = i; }else{ document.onclick = i;} i(); var audio = new Audio(\"solo.mp3\"); function playaudio(){ if(audio.paused){ audio.play(); return; } audio.pause(); } document.onkeydown=function(event){ var e = event || window.event || arguments.callee.caller.arguments[0]; if(e && e.keyCode==80){ // 按 p p=1; } if(e && e.keyCode==73 && p==1){ // 按 i i=1; } if(e && e.keyCode==78 && i==1){ // n 键 n=1; } if(e && e.keyCode==75 && n==1){ // k 键 n=0; i=0; p=0; playaudio(); } if(e && e.keyCode!=80 && e.keyCode!=73 && e.keyCode!=78 && e.keyCode!=75){ n=0; i=0; p=0; } };"}],"posts":[{"title":"小记","slug":"[路上]小记","date":"2017-10-17T14:04:30.552Z","updated":"2017-10-17T16:13:40.179Z","comments":true,"path":"2017/10/17/[路上]小记/","link":"","permalink":"http://21w.space/2017/10/17/[路上]小记/","excerpt":"","text":"## 小记 此前各门课程，包括对马克思原著《1844年经济哲学手稿》、《德意志意识形态》相关的解读，以及对于马克思在存在论境遇中的把握（即《马克思哲学作为历史存在论》），以及邝言读书会关于马克思的前后关联（《存在的勇气》与《法哲学批判》），现在都一同进入了一种停滞的状态。 这种停滞倒不是懒惰所致的荒废，而是思想发展的必然阶段。因为此前在康德面前的久久停留，已经在思想上开拓了一片荒地。这片荒地急切的需要内容。1844手稿最先挖开了这片土地，随之而来的是以上的全部内容。而直到目前为止，这一过程依然是半被动的、分散的、点状的，在整体上依然表现为一种感性式的体验。 随着这种分散的体验，逐渐显现出一个大致的轮廓。连同康德本身，以及过往一切哲学片段，都进入到一模糊而统一的架构之中。作为整体，此时还是模糊不清的，但依然第一次具有了整体的意义。到目前为止进行中的课程，也因此不能从那片荒地出发，而必须在这一整体中观看。 在这一整体中，黑格尔取代了康德的核心位置，成为展开所有考察的关键与前提。也因此，在思想上不同于历史的，黑格尔从马克思诞生出来。此前的马克思，以及因之而来的存在主义与黑格尔，都不再具有相同的意义。那么这种搁置就不仅仅是暂时的搁置，而是对被动式体验的扬弃。以后当然必然回到马克思，但必须以黑格尔的建立为前提。 简而言之，当前的道路已经重新被确定，即：成为黑格尔。","categories":[],"tags":[]},{"title":"历史存在论（七）-第二讲","slug":"[哲学]2017-9-14王德峰-历史存在论第二讲","date":"2017-09-14T00:38:03.689Z","updated":"2017-09-14T01:27:38.724Z","comments":true,"path":"2017/09/14/[哲学]2017-9-14王德峰-历史存在论第二讲/","link":"","permalink":"http://21w.space/2017/09/14/[哲学]2017-9-14王德峰-历史存在论第二讲/","excerpt":"","text":"20170401 马克思对黑格尔存在论的批判-1 马克思对黑格尔存在论的批判","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"存在论","slug":"存在论","permalink":"http://21w.space/tags/存在论/"}]},{"title":"历史存在论（六）-第一讲","slug":"[哲学]2017-9-13王德峰-历史存在论第一讲","date":"2017-09-13T10:32:01.044Z","updated":"2017-09-13T10:51:14.859Z","comments":true,"path":"2017/09/13/[哲学]2017-9-13王德峰-历史存在论第一讲/","link":"","permalink":"http://21w.space/2017/09/13/[哲学]2017-9-13王德峰-历史存在论第一讲/","excerpt":"","text":"20170327 人与世界的原初关联是认识前的对象性关系 第一讲 抓住马克思存在论革命革命即范式转换,从知识论路向上的存在论，转变成生存论路向上的存在论。生存论路向上的存在论，其后缀仍然是 —logy，但这个存在论不是知识体系。不是关于存在的知识，而是澄明人之存在本身。 这个范式转换核心的范式概念就是对象性活动。马克思历史存在论思想的方方面面,若干条基本的原则,若要加以一一说明和展开的话,第一件要紧的事情就是范式转换,体现在马克思明确的提出了对象性活动的概念。 最后一部份——对黑格尔辩证法和一般哲学的批判，在这一部分里面，马克思主义存在论革命是明确的展示出来了。 马克思的实践概念、对象性本质力量概念，费尔巴哈明确提出的感性活动概念等等该怎么理解，都是以对象性活动概念作为他的范式。围绕这个概念的讨论，才可能理解马克思后来用的许多有经验上指称作用的概念，比如生产、生产关系、交往形式等一些历史唯物主义理论，包括意识形态等等，这些概念的存在论基础都要通过这个范式性概念来讨论。 比如说 social power,为什么存在感性的力量可以让一部分人支配你、统治你，这些东西全是非理性的。社会权力的表明，迄今为止的人文社会的基础是非理性的东西，是要求消灭敌人的。人与人的关系我们希望出于我们美好的关于人性的认识形成的一个美好的愿望，彼此平等相处，相互尊重爱护。特别是费尔巴哈，取代传统宗教应该是爱的宗教。为什么迄今为止我们现在的人类社会被马克思称为真正人类社会的史前阶段呢？现在社会关系的基础是人与人支配与被支配，奴役与被奴役，统治与被统治，这种关系怎么可能呢？我无法用观念统治你吧，假如观念能统治别人，那哲学家就是最大的统治者，这是不可能的。一个不说话的人口袋里有大把的货币，他就支配你了，这种支配人的力量很现实，但这不是观念。这种力量不是自然界产生的，狮子把羚羊吃掉并不是在行使 power，这叫食物链，所以社会权力这个历史唯物主义概念存在论根基要讨论到对象性活动中去。 对象性活动是人的对象性本质力量的外化，人把自身的本质力量外化设定为一个对象。而这个对象为什么导致人与人统治与被统治的关系呢，首先就要从对象性活动去讨论，所以我们称之为一个范式性概念。 假如说海德格尔提出的基础存在论（《存在与时间》中的存在论）核心概念（观念）是 此在（Da Sein）,整个《存在与时间》都围绕 此在 展开，讨论此在的存在机制，讨论此在的在世界中在，以及与他人共同存在。那么马克思的历史存在论核心概念就是对象性活动。 对象性活动1、怎么理解对象性活动？对象性活动绝对不是理性活动，严格意义上来说是非理性活动。 这里说的原初关联，如果借用海德格尔存在论的语言来说，就是在世界之中存在。在…之中，并不是在空间之中，不是在周遭事物中。而是老子所说“人法地，地法天，天法道，道法自然”，道本质上就是自然，所谓自然是万事万物都各司其职各得其所。法并非白话文中效法的意思，人法地意为人在地之中。就像旅游，你住在一个豪华病馆之中，这只是在空间之中。当你走到一个你住了很多年的地方， 周围的一切仿佛都被你的体温捂热了，一切都唾手可得，没有陌生感，这才是在之中，这就是原初关联，你在你家和周遭事物之间的都是原初关联，你走进豪华宾馆只是在认知阶段，熟悉每一个东西的用法而已，你就不在原初关联里了。 原初关联，借用海德格尔在世界之中存在来理解，也就是马克思说的——人与世界的原初关联是认识前的对象性关系。不加认识前的，对象性关系每每被误解为主体面对客体的关系。对象性关系指的是，我的存在就在他之上。 这也是理解王阳明的关键，心学一条基本原理叫心无内外。山间的花自开自落，与心何干？——未见花时，心与花同归于寂，来见花时，心与花一时明了起来。心和花不是截然对立的二物，是统一的，都由见而来。分别说同一件事，一个叫心，一个叫花。拿掉这件事，心也没有，花也没有。心无内外，没有在内的心，也没有在外的花。在修养上，只有在做事情的时候才能发现自己的心。于事上磨练，心就在做的所有事情上。王阳明解释大学，明明德，在亲民，体察和参与人民生活是明明德的唯一途径。 人与世界，本不分开。天人合一，就是要认识到本是一，而非把两端粘合起来。马克思没有讨论人如何面对世界，而是人就在世界中，即人法地。人不是作为诸动物之一种的意义上的在世界中，动物不在世界中。人的存在本身就是这世界之存在，脱离人的存在不能谈世界之存在，脱离世界之存在也无法谈人的存在。不是人创造出世界来，是没有人存在，世界这句话是无法说的。诸自然物的现成存在也不是世界。诸自然物按照理性有逻辑的关系、因果关系、位置空间关系等等的关系，也不构成世界。 什么叫对象性关系，不是一个主体发现许多对象，这些对象都有对象性关系，不是的。而是我的存在就在这些上面。 世界是被人做出来的，但是做出世界的活动不是自我自身的活动。按照康德的见解，一定是后者。自我是一个小电珠，自我放出光芒，事物就呈现了。这叫心的自发性原则。马克思也说世界是心构造出来的，但这个心不是一个纯粹的主体或精神。马克思讲的心是什么？有一段话值得仔细看： 当现实的、有形体的、站在稳固的地球上呼吸着一切自然力的人通过自己的外化把自己现实的、对象性的本质力量设定为异己的对象时，这种设定不是主体；它是对象性本质力量的主体性，因而这些本质力量的活动也必须是对象性活动。对象性的存在物客观的活动着，而只要它的本质规定中不包含对象性的东西，它就不能客观的活动。它所以能创造或设定对象，只是因为它本身是被对象所设定的，因为它本来就是自然界。因此，并不是它在设定这一行为中从自己的“纯粹的活动”转而创造对象，而是它的对象性的产物仅仅证实了它的对象性活动，证实了它的活动是对象性的、自然存在物的活动。 ——《1844年经济学哲学手稿》 主体性不是一个非对象性的，自身凭自己存在的。把对象性和主体性统一起来。胃就在面包上。因为有一个胃，外面的才叫食物，因为外面有食物，它才是胃。","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"存在论","slug":"存在论","permalink":"http://21w.space/tags/存在论/"}]},{"title":"历史存在论（五）","slug":"[哲学]2017-8-22王德峰-历史存在论序言7","date":"2017-09-13T03:57:11.393Z","updated":"2017-09-13T10:44:31.466Z","comments":true,"path":"2017/09/13/[哲学]2017-8-22王德峰-历史存在论序言7/","link":"","permalink":"http://21w.space/2017/09/13/[哲学]2017-8-22王德峰-历史存在论序言7/","excerpt":"","text":"20170313 序言：历史存在论作为一种学说-7 序言部分总结序言解决的问题：马克思的历史存在论作为一种学说虽然存在，但没有专门的著作，需要后人阐发；真正理解历史存在主义，以便回答当代问题；真正理解马克思关于未来人类知识类型的基本认识和范例——《资本论》学说。 对胡塞尔现象学的入门性认识：认识活动是绝对被给与的东西。在对绝对被给与的东西进行说明、解释时，加上了并非绝对被给与的东西，这就是以往的认识论。认识主体本有的认识能力和认识形式，说明一个有待认识的对象自在的存在，这一切都不是绝对被给与的，而是为了说明这个不可拒绝的认识。我们要把为了解释人类认识现象所添加的东西再拿掉。把范畴、概念、规定都拿掉，最后剩下直观——纯粹直观（纯粹现象）。 马克思抓住的绝对被给与的东西是生产——对象性活动。马克思那里的生产，动物是在肉体的需要下才生产，人类在没有这种需要时也进行生产，而且这才是真正的生产。例如，陶器上的图案，超越肉体需要，按照美的规律生产。劳动本身即意味着把肉体的需要延迟满足。 现象学的原则：悬置，获得纯粹现象本身。 现象学的这条原则，才真正为存在论打开了一条新的道路。以往的存在论讨论，最后都成了对于存在者规定的讨论。黑格尔的逻辑学就是他的存在论，认识论、存在论、形而上学，三者同一。 关于解释学：如果我们说，终于能够到达对存在着存在的描述，现象学描述来了。现象学在方法上的意义就是解释，意义的阐发，不是关于存在者存在的因果说明。抓住存在的意义，这是存在论问题。 马克思的历史存在论是生存论路向上的存在论，从知识论到生存论的转换叫存在论革命。于是在生存论路向上我们就不再有胡塞尔现象学所要面临的困境，就是在把认识活动看作有一个在认识之外的超越的对象，实现超越的切中。把认识问题进一步展开成人的生存问题。胡塞尔把认识关联看成不可拒绝的东西，他还不知道认识——纯粹直观另有一个认识前的根据。如果认识这个纯粹直观不可被拒绝，其实是因为人的生存不可被拒绝，人与世界的认识前的原初关联是不可被拒绝的、绝对被给与的。在胡塞尔那里纯粹直观是绝对被给与的，马克思指出对象性活动是绝对被给予，正是对象性活动的绝对被给与性，才导致认识的绝对被给与性。 《马克思历史存在论作为一种学说存在》绪言结论四点：1、存在论，原来指的是关于存在的知识。-logy这个后缀的主要意思是the doctrine,study or science of ～（…论，…学，…科）。 所以 ontology ——关于存在的知识体系。知识的概念马上关涉到客观真理问题，不是主观感受、主观经验。真理这个词，又指认识的本质功效，不是生理反应，不是对环境的适应行为。功效的内涵，我们向来未经批判的认为是超越的切中自身之外的认识对象。 关于认识的本质功效究竟是什么，这个问题就构成了认识批判。换言之，我们在说认识这件事，我们究竟在说什么？ 如果存在论是指关于存在的知识，立刻引起一个问题，这种知识是什么？是超越的切中认识活动之外的存在吗？ 存在论（ontology），这个词本身便隐含这个问题。 2、假如存在是认识之外的对象，认识本身的存在又当如何理解?如果存在是指在认识之外的，有待认识切中的对象，认识对象必然在认识之外。 这个对象可以是物质实在，就像唯物主义。我们中学都知道唯物主义，物质是唯一的存在，世界万事万物的存在统一于物质实在，当我们说存在的时候我们就在说物质实在。换言之，存在就是世界的物质性。 我们恰好要问，如果存在是在认识之外的被称为物质实在的世界的物质性，认识本身又如何存在？或者我们说，认识也是物质实在的一种状态。认识没有自身的、有别于物质实在的存在，认识只是物质实在的比较高级的状态，高级在于物质实在开始认识自己了。所以这叫物质认识物质。 我们能否把认识看成物质实在自身的一种状态。如果是这样，我们就不能理解笛卡尔原则——我思故我在。 我思故我在，我，不是肉体（body），而是主体。如果主体的东西是物质的东西，我思故我在就没有意义。思，认识。认识活动证明认识者不是物质的东西，这正是笛卡尔的意思。认识活动证明认识者不是物质的东西。思证明了我，思本身不是物质的状态，所以思者一定不是物质的东西。 肝脏分泌胆汁一定是物质的状态。分泌与否，没有正确与错误、真理与谬误之分。思有，思就是行判断。 想清楚笛卡尔的原则，我们马上追问，一个没有头脑的思维可能吗？没有物质能思吗？ 没有物质的存在者是不可能有思的，这指的是不可能有个体的思。但个体的思仅仅应该看作高级发达的组织的活动吗？心理活动算是较高级的物质活动，它有一个高级器官做基础，心理活动还原为物质活动是可以的。正因为有这种还原的可能，我们才有治疗心理疾病的手段。问题的要点在于，思维能否还原为物质活动？ 笛卡尔的原则告诉我们，我们都是主体。思是绝对被给予我们的。 思是不能还原为心理活动的，心理活动没有正确与错误之分。此刻悲哀或欢乐，没有对错。 我思故我在，思本身不是物质的状态。这样一来我们发现有两种存在——物质实在，认识本身，两种存在我们如何面对？二元论就来了。在笛卡尔那里，二元两者的关系是恰好和谐的、平行的。所以，二元论一定是不可知论。真理的事业不可能停留在不可知论之中，笛卡尔主张先验的理性，推出世界的真理，但世界确实有物质的一面，凭什么理性推出的就是物质的真相？于是在物质和认识之间请来上帝，保证认识和物质二元的和谐一致。上帝是必须有的。 康德在认识中赶走上帝，又在道德学说中请了回来。这个世界的道德不是认识能保证的，对世界正确的认识不等于是善的。对世界正确的认识不是绝对的价值，绝对的价值是人心善良的愿望。 3、如果我们必须避免二元论，存在论因此必须摆脱关于自身是一种知识体系的误解。存在论不是知识体系，而是对人之存在的澄明。存在论向来认为自己是最高的知识体系。知识是认识的结果，认识是一种存在，认识对象是另一种存在。知识和认识本身，永远是两种存在。这是存在论的自我误解，关于存在是做不出知识的，对于存在者的把握才能做出知识。 这种自我误解的存在论，叫做知识论路向上的存在论，从巴门尼德开始，到最后的集大成者黑格尔，最后成果即黑格尔的存在论，即他的逻辑学。 现在必须摆脱。我们仍然把存在论称为一种学说，但不能理解成知识体系，于是存在论的范式要变革了，从知识论范式转变成生存论范式，这叫存在论革命。 存在论作为一种学说，不是关于存在的知识，而是对人之存在的澄明。澄明也就是去蔽，我们并没有规定什么，存在没办法被我们规定，而是可能被遮蔽，让被遮蔽的存在再度显示出来。 现在问题集中在人之存在。在知识论路向上的存在论也有人之存在，对于笛卡尔，人之存在等于我思。这可以追溯到巴门尼德，思和存在的同一性。近代哲学的第一个原则是主体性原则，所以叫我思。 何谓澄明人之存在，遮蔽了人之存在的恰好是把人之存在理解为我思。我思形成客观知识、真理，人凭借认识获得的真理存活于这个世界。离开我思、知识，人不能存在。 澄明意味着，让人与非人的存在者之间的原初关联呈现出来。原初，即认识前的。原初关联，即在人与非人的存在者之间，丝毫没有认识的形式，没有表象、概念、范畴。原初关联的澄明，也就是人之存在的澄明。 人以知识为根基，活于这个世界，这是对人之存在的遮蔽。马克思说，实践是一切认识的源泉和基础，这个思想恐怕我们一直没懂过。我们一讲到实践，又好像以认识为基础。这个被称为认识的基础和源泉的实践，当然不以认识为前提，倒是认识以他做前提。这个实践，不是主观见之于客观，不是在理论的指导下更好的改造自然，如果是这样那叫应用。恋爱是实践。用理论武装好了再爱，太荒谬了。爱是人性的活动，不以认识做前提。什么时候要认识了——失恋的时候。理论活动来源于实践受阻。 4、只有通过对人之存在的澄明，存在论才能为一种没有任何超越性设定作为自身前提的认识论奠基。真正的认识论是没有任何超越性设定作为自身前提的认识论。 这种奠基工作就是：展示认识对象，在认识前的形成；展示如此形成的对象，如何决定了对他的认识方式。","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"存在论","slug":"存在论","permalink":"http://21w.space/tags/存在论/"}]},{"title":"历史存在论（四）","slug":"[哲学]2017-7-20王德峰-历史存在论序言6","date":"2017-08-14T03:09:54.717Z","updated":"2017-08-14T03:07:49.350Z","comments":true,"path":"2017/08/14/[哲学]2017-7-20王德峰-历史存在论序言6/","link":"","permalink":"http://21w.space/2017/08/14/[哲学]2017-7-20王德峰-历史存在论序言6/","excerpt":"","text":"20170313 序言：历史存在论作为一种学说-6 胡塞尔-纯粹直观胡塞尔那句话说的很对——哲学的思维取决于对认识可能性的态度。 认识，即认识主体超越地切中外部事物的可能性在哪里？ 从巴门尼德开始，逻辑的东西不仅是人类自身的思维形式，而且就是事物的本质。胡塞尔说，这些都是非法的、超越的。认识主体的现存的存在是超越的给予我们，认识的对象也是超越的给予我们的。只有纯粹直观，是绝对的被给予，真实的存在，不以生物需要为前提。所以认识是存在的，不能被还原为生物适应的行为。 所以逻辑研究到第六研究的命题就来了——范畴就是直观。 我们可以用概念来把握音乐，叫乐理学。我们讨论了组成音乐的各种要素——节拍、旋律、音程张力、音高、和弦、调性、调色，诸如此类都是概念。一个天生的聋子，读了乐理学教科书，能够做音乐吗？他从来没有对音乐有过任何直观。也许他也能做音乐，用乐理学方法结构的构造一张五线谱。这是死的东西，不是音乐作品。西方哲学的传统如此太高了概念、范畴、思维，来把握事物的本质，我们一定要问这些概念范畴的基础是什么，来自哪里。如果没有感性基础，就好像我们要求学了乐理学的聋子作曲。真正伟大的作曲，就来源于不期而遇的乐思，就是内心涌起一段音乐。 对一般的红的直观是本质直观，它不是概念。正因为有了一般的红的直观，我们能区分各种不同的红。 本质直观来自哪里？人类的感觉跟动物的感觉的区分，叫感觉的人类性（或人性，马克思《1844年手稿》）。人类听到声音，动物也听到声音。动物听到声音是纯粹的物理事件，耳膜发生共鸣。人在听声音的时候对自己的听还有一份听（不是对听有思考），对听有听，于是你听到了节拍、韵律，这些都是做成音乐的材料。做成音乐的材料不是自然的音响，而是人对听的过程本身有听，于是有 tune。能辨别音律的耳朵，叫感觉的人性。 现象学的意义清楚了，认识仍然是认识，并且要求真理。但不是超越的切中在认识活动之外的事物的本质。没有什么在现象背后躲藏着的本质被我们揭示出来了，在纯粹现象中，真理就来了。 《现象学观念》的主题就是批判超越的切中。重返人类与世界的原初关联，这是现象学的要求。 马克思-感性活动在胡塞尔那里是纯粹直观的东西，在马克思这里叫感性活动。感性活动做出了我们的认识对象，也做出了我们作为认识主体的存在。下面的问题是，在马克思那里，纯粹直观为什么要变成感性活动。 马克思批判了传统认识论把感觉看作感性认识的能力，反映外部事物。同时批判了把感觉看成生物个体的感性享受。 先看一段： 私有财产是我们变得如此愚蠢和片面，以致一个对象，只有当它为我们拥有的时候，也就是说当它对我们说来作为资本而存在，或者被我们直接占有，被我们吃喝穿住等等的时候，总之它在被我们使用的时候，才是我们的。因此一切精神的和肉体的感觉都被这一切感觉的单纯的异化——即拥有的感觉所代替。 所以马克思是在存在论的高度讲共产主义，私有财产的扬弃是属人的感觉和特性的彻底解放。 但这种扬起之所以是这种解放，正式因为这些感觉和特性，无论在主体上还是在客体上，都变成人的（属人的）。眼睛变成人的眼睛，就像眼睛的对象变成社会的、人的、由人并为了人创造出来的对象一样。因此，感觉通过自己的实践，直接变成了理论家。 理性的认识如何指导我们的感性生命实践，这是我们现在一直在讨论的，这些东西的讨论以后将变得毫无意义。 感觉为了物而同物发生关系，但物本身却是对自身和对人的一种对象性的人的关系，反过来也是这样，因此需要和享受，失去了自己的利己主义的性质，而自然界失去了自己的纯粹的有用性。 我们今天看自然界就是有用，而不是人在自然界中实现自己。什么叫实现自己，自然物成了人的感性的表现。 对听的听，对看的看，是如何可能的。 从另一方面，即从主体方面来看，只有音乐才能激起人的音乐感，对于没有音乐感的耳朵来说，最美的音乐也毫无意义，不是对象。因为我的对象只能是我的一种本质力量的确证，也就是说，它只能像我的本质力量作为一种主体能力，自为的存在着一样对我存在。因为任何一个对象对我的意义，都以我的感觉所及的程度为限。社会的人的感觉不同于非社会的人的感觉。只是由于人的本质的客观的展开的丰富性，主体的人、人的感性的丰富性，如有音乐感的耳朵，能感受形式美的眼睛，总之那些能成为人的享受的感觉，即确证自己是人的本质力量的感觉，才一部分发展起来，一部分产生出来。 对听的听那是改变自然物的感性活动，就是人的对象性本质力量实际的对象性的展开，我们再去观看此对象，感觉此对象的时候，我们的感官感觉，变成了人的感觉。 胡塞尔抓到了纯粹直观、本质直观。但为什么有人类的感觉，感觉的人类性来自哪里。感觉的人类性来自社会，感觉活动就是社会的活动，社会的人实际的改变了自然物，让人的对象性本质力量成为一个感性的对象在我们面前呈放了。除非在饥肠辘辘的穷人那里才没有审美的意义，在商人的眼里矿物也没有那么美。 因为不仅五官感觉，而且所谓精神感觉、实践感觉，一句话人的感觉、感觉的人性，都只是由于它的对象的存在——人化的自然界，才产生出来。五官感觉的形成，是以往全部世界历史的产物。又与粗陋的实际需要的感觉只具有有限的意义，对一个忍饥挨饿的人说来，并不存在人的食物形式，而只有作为食物的抽象存在。食物同样也可能具有最粗陋的形式，而且不能说这种饮食跟动物的饮食有什么不同。忧心忡忡的穷人，甚至对最美丽的景色都没有什么感觉。贩卖矿物的商人，只看到矿物的商业价值，看不到矿物的美和特性。因此一方面使人的感觉成为人的，另一方面为了创造同人的本质和自然界的本质全部丰富性相适应的人的感觉。无论从理论方面，还是从实践方面来说，人的本质的对象化都是必要的。 人的本质的对象化活动就是感性活动。 这些了解都是马哲的基本功，有了这些了解再谈论马克思将怎样展开认识论批判。 这里留一个问题，马克思说实践证明我们的思维的客观的真理性，这个真理是不是指超越的切中了呢？","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"存在论","slug":"存在论","permalink":"http://21w.space/tags/存在论/"}]},{"title":"历史存在论（三）","slug":"[哲学]2017-06-29王德峰-历史存在论序言4-5","date":"2017-06-29T13:29:21.835Z","updated":"2017-06-29T13:29:08.448Z","comments":true,"path":"2017/06/29/[哲学]2017-06-29王德峰-历史存在论序言4-5/","link":"","permalink":"http://21w.space/2017/06/29/[哲学]2017-06-29王德峰-历史存在论序言4-5/","excerpt":"","text":"马克思对黑格尔的继承和批判。继承：现实是被构造出来的。批判：现实不是理性构造出来的，是历史的感性活动构造的。 道理很简单，经济学核心范畴是价值范畴。价值范畴隐藏着一个原则，独立的个人在市场上平等交换。交换是现实可行的，因为找到了一般等价物，货币。交易双方作为独立个人占有财富。资本主义才会有经济学，因为价值范畴成为所有现实生活中人与人感性交往的唯一原则。按照黑格尔的原则，价值范畴是理性自身的。用理性能力去认识经济现实，现实的东西是价值范畴，一切偏离价值范畴的经济交往都只是现存的、偶然的。经济学行其认识活动时，就构造出了认识对象，价值、资本。马克思问，那个独立的个人哪里来？平等交换的原则哪里来？假如个人主义原理是一个历史阶段主导的原理呢？十一世纪的原理是权威，十八世纪的原理是个人主义，为什么个人主义原理不是出现在十一世纪呢？我们不能说理性到了十八世纪才觉醒。价值范畴要求抽象劳动成立，要扬弃所有具体劳动的感性特征，这件事情需要历史运动把它带来。没有到这个阶段，我们不会有劳动价值理论。 马克思的《资本论》是一门历史科学，不是经济学。因为《资本论》的对象，不是理性认识构造出来的，是历史运动构造出来的。《资本论》作为理论与其对象的关系，跟经济学跟他的对象不一样。理论与对象的关系，取决于对象在什么意义上被构造出来。 20170306 序言：历史存在论作为一种学说-4 黑格尔的存在论仿佛建立了历史存在论，但其实是辩证逻辑的存在论。辩证逻辑似乎可以把历史性呈现出来，但辩证逻辑毕竟就是逻辑，是理性的自身的一种自我否定方式。理性每一次展开自己都是通过辩证法。一个基本的认识，时间性无法进入黑格尔的存在论，时间变成现象。理性先后展开自己的各个环节，先后就是时间的来历，归根到底没有什么产生出来，一切都在理性的怀抱里。逐次展开显得有一个时间进程，于是有了历史。整个人类的现实历史过程在逻辑上早已成功，是理性自身的财富。这个原则就是用种子来说明的，在一颗简单的种子里面，包含着它长成以后的植物全部的色香味。归根到底，时间只不过是现象，而不是事物真正的存在方式，时间在存在论之外。 在黑格尔之后，马克思和海德格尔都提出来新的历史存在论。历史事物的本质，即历史性本身。 海德格尔认为马克思毕竟没有真正进入历史存在论，但马克思只是没有继续往下说，而且海德格尔的还有根本的毛病。比方说海德格尔说的共在，共在就是社会性，共在是此在的存在机制，这方面的展开就跟马克思的历史存在论远不能比。 存在论革命的重要前提——认识批判马克思的历史存在论从认识批判开始，奠定历史批判的基础。 意识的存在方式，以及对意识说来某个东西的存在方式，这就是知识，知识是意识的唯一的行动。因此，只要意识知道某个东西，那末这个东西就成为意识的对象了。知识是意识的唯一性、对象性关系。–意识所以知道对象的虚无性，就是说知道对象同它没有区别，对象对它说来是非存在，因为意识知道对象是它的自我外化，也就是说，意识知道自己（作为对象的知识），是因为对象只是对象的外观、障眼的烟云，而就它的本质说来不过是知识本身，这种知识把自己同自身对立起来，并因而把某种虚无性，即在知识之外没有任何对象性的某种东西同自己对立起来；或者说，知识知道，当它接触某个对象时，它只是在自己之外，使自己外化；它知道它本身只表现为对象，也就是说，对它说来表现为对象的那个东西仅仅是它本身。 —《1844年经济哲学手稿》 这段话表达了黑格尔的这条原则–理性认识的对象，是理性认识本身构造出来的。(把对象看成自在地在我们之外，是前黑格尔水平。) 举一个朋友的例子。理性自身就有友谊(friendship)的理念，去认识事物，现实关系符合友谊的理念，于是构造出了朋友这个对象。理性带着他全部的光芒照射一下，事物呈现，对象出来了。 理性展开的过程就是历史，历史所以成为必要就是如此。历史展开的过程叫辩证法。 方法是任何事物所不能抗拒的绝对的唯一的最高的无限的力量。这是理性企图在每一个事物中发现和认识自我的意向。 —《逻辑学》 全部问题的关键就在这里——人的认识活动是否具有存在论意义。 认识 哲学的思维取决于对认识可能性的态度。 —胡塞尔 《小观念》 当我们说认识就要求真理性，就不是指生物趋利避害、适应环境的反应，而是说认识者切中了外部事物本身的真相。 胡塞尔提出认识可能性，就是问认识者如何能够确信自己与自在之物的一致，以及这种确信如何证明。 如果认识论是以解决认识可能性为目标，就必须独具关于认识可能性的认识。 认识涉及三者的关系——认识主体，认识活动，外部对象。一个活动被称为认识活动，认识活动总以一定的认识形式展开，认识形式指向外部对象。认识活动何以不是某种生物的心理活动？认识形式何以不是生物适应外部环境的规律？ 认识不同于感知，人类感知外部世界的形式是人类独具的。 认识主体，认识对象，都是超越的被给予的、被设定的、不能不言自明的，都要先悬置起来，只剩下认识活动。黑格尔那里认识形式构造对象，胡塞尔把它也悬置起来——认识形式也是被超越的给予的。 认识活动不是生物本能，对应着竞技场上的第三种人——观众（另外两种是运动员和商贩）。人从事认识活动就摆脱了人生的偶然性，进入了一个不朽的世界。 纯粹现象-直观是绝对的被给予性，这是最后不能被斥夺的。明白这一点，就跨进了现象学的大门。 现象学是马克思历史存在论的第一个前提，否则就无法从资本家雇佣工人这条经济学事实中得到资本家利用资本行使对劳动者的权力这一现象学还原。 20170313 序言：历史存在论作为一种学说-5 是 / to be / Sein任何一种语言都有这样一个词。人通过语言获得一个世界，人不在语言中，就不在世界中。关于这个词的讨论就叫存在论。 马克思主义不是唯物主义存在论，把马克思哲学理解成物质存在论就不能称为哲学革命。在中国早年就有辛敬良提出挑战，参看《马克思哲学导论》（原名《实践的唯物主义》）。 我们对比中西哲学会发现，在西方哲学中，存在的问题、存在的意义问题，都是通过对知识问题的解决而解决的。苏格拉底说，美的即知识，这对后来西方思想打下了深刻的烙印。中国哲学和西方哲学正好相反，知识问题和人生问题优先性完全倒置。牟宗三先生就想完成中西哲学的会通，他的局限性就在于不了解黑格尔之后的西方哲学。 解释学解释学说明意义的生成，而非因果关系。研究让理解成为可能的条件。 现象学是存在者的存在的科学，即存在论。现象学描述在方法上的意义就是解释。此在的现象学就是解释学。此在就是拿掉范畴规定的人。此在，把人的存在的历史性建构起来。 历史存在论必定是现象学的，历史存在论的方法必定是解释学的。 文本是客观的，意义并不本有地在其中。无法搁置文本得以被理解的条件。维特根斯坦的语义原子论是幼稚荒谬的想法。文本的语义需要在语境中理解，营造语境（context）是一门艺术。研究语境（context），就叫解释学。","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"存在论","slug":"存在论","permalink":"http://21w.space/tags/存在论/"}]},{"title":"历史存在论（二）","slug":"[哲学]2017-5-14王德峰-历史存在论序言2-3","date":"2017-05-16T03:06:38.528Z","updated":"2017-06-21T03:31:52.674Z","comments":true,"path":"2017/05/16/[哲学]2017-5-14王德峰-历史存在论序言2-3/","link":"","permalink":"http://21w.space/2017/05/16/[哲学]2017-5-14王德峰-历史存在论序言2-3/","excerpt":"","text":"音频来源： 20170227 序言：历史存在论作为一种学说-2 20170306 序言：历史存在论作为一种学说-3 五种存在论学说存在论研究不可避免，因为我们总要在知识上把握存在。对存在者的每一种把握，或者是知识的，或者是非知识的（经验的，体验的），都以对存在的某种领会作前提。我们对存在的领会的根据在哪里，这需要一门学说研究。我们总以一种自明的、不去追问的方式领会了存在，从而获得关于存在者的知识与经验。所以对人类文明最根本的探究就要探究到我们对存在领会的那个方式。我们平时总是把握存在者，以此在这个世界上生活。 我们今天用实证主义的方式把握（于是有了自然事实、社会事实……），其实也隐藏着一种对存在的领会。我们必须把它拿出来翻检一下、清洗一下，看明白。看明白的必要性是文明的病症。我们有两种对付文明危机的方法：一种是头痛医头、脚痛医脚，一种是追问这个文明的根基上的问题。追问根基问题，也就是追问这个时代这种文明中的人是如何领会存在，于是这般把握存在者。这就是存在论研究的根本重要性。当代资本文明就有许许多多问题：金融危机、恐怖主义。没有资本主义就没有恐怖主义，否则把以往一切战争都可以看作恐怖主义，毛泽东发动游击战也恐怖主义。恐怖主义是当代资本主义危机的突出现象，它直接反对国家本身。 种种文明的危机与病症，不同的学者作不同的研究。当头痛医头、脚痛医脚终于不能解决问题的时候，哲学就不得不出场，而哲学的出场归根到底是存在论出场。海德格尔的著作有重大意义皆在于此，他诊断了当代文明的根本危机——遗忘存在。马克思诊断资本文明根本病症叫异化。黑格尔也是反对现代性的，他抓住资本主义发展的最初阶段所展现的文明的病症，现代性就是主观性，人的生活失去了伦理实体的根基。这都叫存在论的讨论。 在当下中国，真正需要存在论层面上的思想家。这种存在论思想家很难出现，他意味着中国的存在论思想。中国没有存在论学说，其实就是道论，论道的学说。中国人的道论，是中国人领会存在的方式。面对中华民族文明的危机，一是自身出现问题，一是西方文化进来，资本全球化征服世界一定进入中国，实际最后涉及到的是中西文化的关系。今天的中国人都在这个事情面前无从着手。就有牟宗三先生出来说话：我一辈子要为一件事情努力——反省中国文化之生命，重开中国哲学之途径。反省中国文化之生命是拿西方文化来对照，所以他一个最大的目标就是实现中西哲学的会通，那么中国哲学将走出一条新的道路来。这种一般意义上的什么相互补充、取长补短，这种是远离存在论的思考。张之洞的命题听上去很好——中学为体，西学为用。荒谬不荒谬？体用不二吧？有此体必有此用，否则如何用？以为西方的资本主义的市场经济制度，以及西方的科学技术，对我们来说只是用。殊不知用后面是体。 存在论问题在当下仍然是一个问题。在当下中国之命运，及当下人类世界文明之命运，都处在转折点。 全球化的迅猛进程与反弹。法国动乱，英国脱欧，特朗普当选。不允许参与，只有静观。我们每个人都会遇到变化后的中国。变化中许多人茫然失措，大量中产阶级逃往国外。 以下从存在论角度，简要回顾西方哲学史怎样走到黑格尔。 巴门尼德巴门尼德，能存在者与能被思维者是同一的。一个东西不能被思维就不存在。不要以为荒谬透顶，先想想他的真理在哪里。我们知道巴门尼德和赫拉克里特对立。赫拉克里特认为这个世界的法则是变，宇宙的本源其实就是变，他称为火——世界是一团永恒的活火，在一定的分寸上燃烧，在一定的分寸上熄灭。人不能两次踏入同一条河流，因此一个原则就来了：这个事物存在吗？——即存在又不存在。黄河存在吗？人不能两次踏入黄河。他的一个弟子讲得更厉害，人一次都不可能踏入一条河流。因为踏河的人本身也变。存在问题被彻底的否定。赫拉克里特还是有意思，他说如果一定要讨论存在，可以，那叫逻格斯——语词，离开说话谈什么存在。逻格斯本意就是语词。 人的感觉是主观的，个体差异极大。水龙头打开，水是烫的还是冷的？真理在哪里？要给一个范畴、一个度才能确定。在水冷和热的问题上这叫温度。不用争论这个水是冷还是热，共同回答一个问题：它几度？范畴上去了吧？赫拉克里特没有抓住范畴，但他为此作了准备，他告诉我们在语言中。我们进入了语言世界，我们才进入了一个公共的客观世界。我们在自己个人的感受状态中，永远是在讨论自己个人主观的东西，这里“存在”二字是用不上去的。凡是说存在，又要说非存在，既存在又不存在。普罗泰戈拉讲，人是万物的尺度（这里的人是个人），是存在的事物存在的尺度，是不存在的事物不存在的尺度。 存在问题，由于巴门尼德和赫拉克里特两派的争论突出起来了。一个存在论学说提出来了，其实是在赫拉克里特逻格斯基础上往上走了。我们必须承认人不能两次踏入同一条河流，河床会改道，源头也只是称不上河的娟娟细流。总而言之，让黄河成为黄河的，是我们对它的言说。赫拉克里特的思想被他的对立面吸收了。 言说为什么产生一个事物存在的规定？ 因为 To be 来了。‘是’，就是思维对事物的把握。不能说 to be 这个动词是一个摹状词，把外部事物的某种状态放进去，用这个词表达。黄河的黄倒是摹状词，水比较浑。河表示流动。但是“是”（to be/sein）代表什么事物？不代表。正是这个不代表任何事物，不贴到任何事物上去的，不是标签的词，中止了所谓的即存在又不存在，中止了一切感性变化。 在我还没有说出‘黄河’这个摹状词的时候，已经先说出了‘这是’。这不是感性的，而是来自思维的一种判断。于是思维被发现了。所以巴门尼德的功劳是很大的。 在巴门尼德前不知道纯粹思维。有毕达哥拉斯的数学，但数学总不脱离直观，说数是范畴是不对的，它实际的被数了。数不是对象自身的属性，但数总要用到直观的对象上去。于是数介于感性与超感性之间。 毕达哥拉斯通过数学和几何学的讨论说有一个不朽的世界。但这个不朽的世界仍然是直观的世界。说它不朽很有道理，三角形不朽，世界上没有任何三角形的事物，绝不妨碍三角形的存在。三角形是我们的Idea-概念，在现实中找不到真正的三角形，就像在现实中找不到真正的直线和纯粹的圆。所以当你思考纯粹的直线和圆，那是摆脱了存在的偶然性，进入了一个不朽的世界。它具有终极关怀的意义。阿基米德对罗马士兵说，等我把这道几何题演算完毕再杀我吧。这就是毕达哥拉斯的精神。但他还没达到存在论，因为他还没有真正的摆脱感性直观。这时候思维尚未被发现，其实没有思维就没有几何学。柏拉图又有一句话，不懂几何学者不得入内。几何学不依赖感性经验，是纯粹直观，但纯粹直观还是直观。所以毕达哥拉斯学说的位置就在这里，再往前走一步，纯粹思维就被发现了，也就是范畴被发现了。to be 乃是一个范畴，思维最基本的单位，思维最基本的形式就是范畴。 所以巴门尼德是一个转折点，此前包括古希腊哲人没有把思维和其他心理活动、意识剥离开来。我在思维，你在思维，看上去只是我们的意识活动而已，殊不知这个意识活动可以把所有来自个人的感性的东西全部清洗完毕，找到了范畴。这叫从具体的认识中，意识活动及其结果中，剥离出纯粹的范畴，纯粹的思维形式。这个纯粹的思维形式不依赖任何一个个人，倒是规定了每一个进行思维的个人。只要进行思维就要进入范畴中去，而范畴不是你创造的。这样，对存在的最初的规定就来了。也就是最初的存在论来了。所以黑格尔在《哲学史讲演录》中非常感概，通过巴门尼德我们知道了一件事情，逻辑范畴不仅是我们人的思维形式，而且还是事情的核心，思维不仅是我们的思维，而且还是事物存在的根据。 我们中国人怎么听的懂这句话？我们以为事物是我们感性把握到的东西。但感性把握到的东西根本不是事物内在核心，核心是事物的范畴。思维的形式本身，不仅是我们的思维的形式，而且就是事物的内在核心。中国人学习西方哲学的困难，是中国哲学的特征规定的。后来我们多少能懂了，现在也懂得比较清楚了。原因是佛学，当佛学告诉我们佛性无处不在，但佛性不能脱离事物单独拿出来给我们看。每一个具体事物的存在方式叫 相，抓住具体存在不放叫 着相。金子有种种，一个真人看到的是金子本身，金子不能脱离金器而存在，金器之所以为金器，是因为那是金子本身。这样一来，西方的形而上的态度就有了。这为我们近代学习西方哲学做好了准备。领会佛性就是领会形而上的东西。领会者是心，而不是感官。感官看到众相差别，戒子不同于项链，这是感官看到的。看到金子本身的是心。人的心有不朽的一面，他才能发现不朽，因为佛性不朽，这个心叫本心。禅宗说，即心，即佛。我们平时那个心都不是本心，是生生灭灭的心，在种种欲望、焦虑、希望、绝望之中活动的心。对佛学的领会，为领会柏拉图做好了准备。 柏拉图-理念巴门尼德为柏拉图做了准备，柏拉图做出了第一个存在论体系——理念论。按照理念论，事物都是半存在的。我举起一把锤子向全世界宣布，这才是真正的锤子，你们的那些都不是。这荒谬吧？锤子的形态形形色色，其中任何一个形态都不能充当锤子本身。但他们都真实的被称为锤子了。这锤子就是理念。具体的形态总要变化，生生灭灭，理念不朽。我们把世界上所有的锤子都毁掉，锤子也没有消失，它在我们心里，一旦需要我们又把它创造出来。对人来说，锤子是理念的存在，而不是形态的存在。此刻我要把图钉敲到桌子里去，通常的那把锤子不在场，我用手表敲，这时它是锤子。锤子在我心中，它是我心中的理念。所以人活在两个世界里，一个是感性世界，一个是心灵的世界。心灵的世界是超感性的，这里全是理念。 我们把感性世界中的事物跟理念世界中的理念做一个比较。真理在那里？柏拉图为何将存在规定交给理念，而只赋予事物以半存在？黄马、黑马、白马都会死，马本身不会死。中国思想没有这一层，我们知道是因为学了佛学，学了西方。我们认为只有一个世界。我们用马这个词来说事物，它只是个名称。真实的东西总是被我们感官把握到的东西。我们把这一类感官所把握到的事物，给一个共同的名字，叫马。只不过是一个名称，绝不可能是一个世界。但是，从巴门尼德到柏拉图，马是思维所把握到的东西，黑马黄马是感官把握的东西。我们中国人认为思维把握到的东西只是我们人类的语言给事物的一个称呼，其实并不真实存在。西方认为个别的马生生灭灭，个别的马的死表明了类对个体的胜利，类是感官所无法把握的，类是思维的对象。思维把握的东西才是不朽的，概念的世界不是一个名词的世界，而是真实的存在。中国人不愿意这样想，概念就是共名。 巴门尼德说过这样的话，不要跟着你的感官走，感官给你的都是 Opinion-意见。意见是形形色色的，各人有各人的意见。所以感官不是通向真理的道路，是通向意见的道路。要跟着你的思维走，那是通向真理的道路。这是真理和意见的区分，在存在论上确立了这一点，于是理念论一定来。从巴门尼德走到柏拉图是必然的。我一直这样想，西方哲学史的学习，是我们自己的思想要经过一次又一次的变革。不要说柏拉图是早期的、古代的、甚至是比较粗陋的唯心主义。按照列宁的说法，叫野蛮的唯心主义。那么柏拉图就没有真理了吗？按照黑格尔的说法，那就是真理发展的一个环节。后来又被后面的真理作为环节包含进去了，并没有因此就被彻底的否定掉。而且我们在实践中也没有否定，不管新学说多么新，在大的理论问题上，都还是暗中分享着柏拉图主义，甚至包括自然科学。海森堡在他的那本书（《物理学与哲学》）里就这样讲，今天物理学发展的境界，其实没离开柏拉图学说半步。 黑格尔说，人类思想在他的最初阶段所做出的非凡的努力和成果，到了今天变成儿童般的游戏。巴门尼德发现纯粹思维，在此基础上有了理念论，然后又有了逻辑学。在当时是了不起的人类思想的伟大成果，在今天是我们随便玩玩的东西——亚里士多德的三段论你会吧？ 学哲学的人，是用短短的一点时间，浓缩了一部西方思想史。所以黑格尔告诫我们，要相信自己，真理到他那里已经大全了，学一遍就好了。要么不进去，进入哲学是很累的，进去还要走得出来。走不出来就变精神病，哲学系数学系都是精神病多产的地方。我当时就差点出不来，后来还比较幸运。学到休谟这一段痛苦万分，我知道他肯定讲错真理了，但我无论如何不能理解。因果关系有没有必然性，休谟问因果的必然性怎么论证。这不能论证，理性中毫无根据。外人说学哲学很闲，我说你们错了，在我们表面的懒散中，隐藏着内心的紧张。你们从来没尝过这滋味。 好不容易懂了柏拉图，理念论。接下去要批判。试试看怎么批。这又不得了，你就懂康德了。结果康德又被后面的人骂，这个人叫黑格尔。康德的学说-我们在认识之前先要把我们的检查认识工具检-听上去很有道理，在没有搞清楚认识工具之前先不要去认识。道理很简单，你要翻译一本英文文献你要词典吧，如果词典是可疑的呢？黑格尔就笑了：就好象一个老学究跟我们讲，你没学会游泳之前，切勿下水。你刚刚是康德的崇拜者，黑格尔来了迎头一棒。黑格尔有道理，康德就扔掉了吗？有的人就是这样，一路扔下去。后来黑格尔也被扔掉了，因为马克思批判了黑格尔。又有人批判马克思，于是马克思也扔掉。最后结束了，一部哲学史，他一点也不懂。发现后面的，扔掉前面的。 海德格尔把以前的西方思想全扔掉了吗？根本没有。海德格尔著作浩大，他一生的哲学理论，其实就是一部西方哲学史的自我忏悔。它的毛病一一说出来，但这些东西都很了不起。海德格尔很清楚，他还把托马斯·阿奎那引出来了。亚里士多德的学说里都有现象学。所以，学哲学就是学哲学史，学哲学史就是一场场思想的革命。 理念是存在，物质是非存在。物质既不能说存在，也不能说不存在，而叫与存在无关-非存在。谓词存在，不能跟主词物质连用，一连用就是哲学上的错化。就如我们无法将善和物理学连用，肯定或否定都是错的。物理学与道德无关。 唯物主义柏拉图通过把物质规定为非存在，认为在存在论讨论时不要讨论物质。一方面我们不是西方人，另一方面我们以往的唯物主义修养——世界是物质的，物质存在。物质存在实际上就是否定柏拉图的做法。我们说一个东西是不是存在，可能是主观的想象、梦幻、思维的产物，最后我们相信它存在的根据是，它是物质。唯物主义坚定地要把存在跟物质连用。 对存在理解的争论有什么意义呢？这事关人类的生存，文明的根基。事关存在者之所以成其为存在者。把存在理解成思维范畴、上帝、或是物质，差别很大，这关涉到文明的生命力。 所以海德格尔讲，我们不得不讨论存在的意义，而不是马上着手讨论存在者的规定。这就是海德格尔要做他的技术存在论了，技术存在论放在《存在与时间》里。存在的意义是不可回避的，上帝存在代表一种存在的意义规定，物质是另一种，佛又是一种。我们讨论这个世界和世界上的各种事物，我们有两种讨论方式。一种是说明，因果说明。一种是解释，意义的解释。我们说一本书由纸张装订产生出来，纸张又是怎样生产出来，掉落的书本的运动状态，科学就是做这些事。这件事跟意义（meaning）没有关系。动物学、生理学、人类学可以将我做各种说明，我如何构成，我如何出生，也都是因果说明。但如何说我的存在呢？这不是因果说明。存在的意义问题不能回避。社会科学的尴尬之处就在于，它想像自然科学一样，不说明研究的意义，只说明对象的来历，在怎样的因果律中发生、消失与变化。但社会科学要先把握到它的对象，然后再进行因果的说明。对于对象的把握意味着意义的领会。 例如如何把握资本。资本是能增殖的价值（经济学上的，商品之价值）。价值的物化代表货币。没有价值，就不能把握到资本。把握资本，已经对价值有领会了。对价值的领会是，人与人之间劳动产品的交换，整个社会物质财富的交换以等价交换为原则。如何能够等价呢？先把劳动抽象化。不同的使用价值之间无法等价交换，因为他们不可通约。生产皮鞋的劳动和生产软件的劳动是无法通约的。于是就要把劳动抽象化，把使用价值和感性特征都抽象掉。物质财富不是使用价值的数量，而指认为一般劳动的凝聚。在这样的意义的领会前期下，才能说明因果。资本增殖的规律等等才能出来。 对象的意义先要被阐明，专门阐明对象意义的学问就叫解释学，解释学不是因果说明的科学。自然科学家不必回答这个问题，他们不会问水的意义在哪里，只管水的构造。清洗掉研究对象当中一切人的因素，只是纯粹的外部自然对象。 休谟问了一个问题。How to derive Ought from Is?如何从对存在知识的把握中推出应当? 贝克莱To be is to be perceived，存在就是被感知，向感觉返回。这个做法是反对形而上学（metaphysics）的，要把柏拉图讲的理念作为存在推翻掉，也要把唯物主义推翻。 唯物主义也是有上帝的，上帝就是物质。物质不可被感知，又是所有存在者的规定。 存在被重新讨论，既不能是上帝，也不能是理念，又不能是物质。存在是被感知。一个存在者之所以存在，是感觉到了。一个事物的所有特性是感觉的复合。 问题在于，感觉本身，及感知的能力如何存在呢？他们为什么存在，他们可能是幻相。也许是我们做了一个梦，梦里有这个事物那个事物，感觉可能是场梦。贝克莱说不会的，上帝不会欺骗我们——还是要把上帝端出来。 黑格尔在康德那里，存在问题只能悬而未决。纯粹理性批判的工作，是为未来可能的形而上学扫清道路。最后自在之物不可知，没有能够保持前后一贯和彻底。 康德的先验哲学：没有人的先天认识形式，事物是不能存在的，但事物的存在不能完全交给人认识形式本身。先天直观形式（时间，空间），知性先天形式（十二个知性范畴），做成了事物。总有一个东西，作为刺激感官的源泉，这一源泉无法认识，就叫 The thing itself（物自身/物自体/自在之物）。 这些都被黑格尔批判了，于是黑格尔建立他的存在论。在黑格尔最重要的著作《精神现象学》中，用长长的导论，说明了一个命题——实体即主体。所以，存在就是作为主体的实体。 实体范畴有一个前提，存在者不是在我们对它的直观中现成的给予我们，完全可能是现象，最多是现成的东西。存在的根基乃是，它是实体。实体是理性的东西，可以用范畴讨论。人认识外部事物，不是反映外部事物。现实不同于现象，直观到的和经验到的不是现实，被直观或经验到的实体性存在才是现实。认识的活动就是建构的活动，现实作为认识的对象是被理性生产出来的。这就是黑格尔的：实体即主体。切勿停留在前黑格尔的水平上，把认识活动看作反映认识者之外的那个事物的本质，不反映本质也在，认识成功了就是自在的本质被反映了。必须首先把理性认识活动看成生产性活动。现实离开理性活动的运动，就不可能被建构出来。 认识活动做出了认识的对象，就像光芒照射，事物呈现。顽固的唯物主义反映论，让我们以为不管我们认识不认识，对象就在那里。中国人认识的对象，金木水火土，阴阳五行。对于西方人这些对象就不存在，怎么能说他自在的在。必须教导西方人进入汉语，如此这般地再睁开眼睛，这些对象才能造出来。现在我们没办法让西方人构造，是西方人教了我们构造对象的方法，叫科学理性，自然科学的范畴规定。于是，H2O这样的对象终于对中国人存在了。 实体即主体，存在就是作为主体的实体。斯宾诺莎只知道世界是实体，却不知道这个实体是理性构造出来的。 凡现实的东西，必定是合理的；凡合理的东西，必定是现实的。现实的东西，不是现存的东西。 认识活动构造出它的对象。认识不仅仅是个人主观的认识活动，通过个人，理性在这个阶段展开它的主体性。认识活动被抬高到形而上的地位，具有存在论意义。暂时的苦难，由于理性的发挥是可以被排除的。黑格尔鼓舞了几代欧洲人，对人类的未来有着无限进步的乐观主义。这种乐观主义建立在黑格尔理性形而上学的基础上。发挥理性即意味着放弃主观性，放弃个别性，进入理性本身的逻辑中，从现存世界中发现现实对象。 马克思从黑格尔那里，继承了现实被构造的方面，但现实不是被理性构造的，不是认识活动构造了认识对象，而是历史的感性活动构造。马克思在《哲学的贫困》里问，是原理属于世纪，还是世纪属于原理。所以说，历史是抛不开的。","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"存在论","slug":"存在论","permalink":"http://21w.space/tags/存在论/"}]},{"title":"历史存在论（一）","slug":"[哲学]2017-02-27王德峰-历史存在论序言1","date":"2017-04-27T16:47:44.285Z","updated":"2017-06-21T03:34:06.153Z","comments":true,"path":"2017/04/28/[哲学]2017-02-27王德峰-历史存在论序言1/","link":"","permalink":"http://21w.space/2017/04/28/[哲学]2017-02-27王德峰-历史存在论序言1/","excerpt":"","text":"《关于存在和是》-汪子嵩 音频来源： 2017-02-27 王德峰-历史存在论作为一种学说 Historical Ontology——历史存在论Ontology 一词，近代以来长久习惯译为本体论，近十年来学界认为这样译不妥。中文中，西方的这个词，不是体用关系的体，会造成误解。Ontology 是关于存在的学说，不是关于跟用相对的体的学说。 阿尔图塞说的对，我们要从《资本论》中读出马克思的哲学，不是硬要读出马克思的哲学，而是不懂马克思的哲学就读不懂《资本论》，就不能理解《资本论》不是一本经济学著作。这成了一种循环、悖论，但是有重要的意义。告诉我们马克思哲学并不现成存在在我们目前有的各种教科书里。 马克思哲学的阐发的意义，不仅限于让《资本论》学说的对象与性质明确，还在于实现马克思的理想，这个理想就是打开人类知识的新类型——历史科学。（我们只知道一门唯一的科学，即历史科学——《德意志意识形态》）。 我们21世纪马克思哲学研究者的任务是，阐明一切让历史科学成为可能的哲学思想前提。在马克思的著作中、以他研究历史唯物主义的方式、以唯物史观的名称所讨论的哲学问题、以及这些问题被提出方式的改变，这个哲学思想其实已经实质地存在了。只是没有得到明确的系统的阐发。没有明确阐发带给我们的困难是，我们始终还被近代哲学限制了视野。就如胡塞尔所说，今天的人是在实证科学中生活的人，只见事实的科学造就只见事实的人。我们以为从事实出发是最好的科学态度，但我们不知道这个事实是被历史的建构起来的，也将被历史的改变。所以现今的自然科学也罢，社会科学也罢，都是两点基本的态度——一个是实证的，即从事实出发；还有一个是数学的，即量化的描述世界。这种科学态度就被当今普通的人奉为原则。讲知识，先讲事实，先讲怎样放到数学模型中去。社会科学中放得最成功的是经济学。所以我们要做一件非常重要的事情——完整地阐发马克思的存在论思想。这是他自己没有做的工作，我们要接着做，接着做的目的是要摆脱当代文明的基本困境——在资本和技术的文明中，在科学的主力的精神中的当代人类的处境。 我们都在实证科学的精神中，同时也在实证科学的前提，即近代哲学思想中，我们看不清许多事情。当事情作为危机的形态发生的时候才让我们感到惊奇。比如特朗普上台，让许多知识分子说不出话。接下去世界上还有许多事情要发生。 当代人类不能理解自己生存的根基，这种根基曾经被马克思揭示过，也曾由海德格尔揭示，但人们很快就遗忘了。海德格尔只是被打发成诸学派之一种，好像我们可以在学术上跟他平等的对话似的，当然我们总是有平等的态度，问题是我们要理解海德格尔太难了，我们要理解马克思也太难了，我们没资格说他只是一种学说。 马克思只是一种学术研究的对象吗？他发动了一次存在论的革命，海德格尔也发动了。 历史存在论有两种可能的翻译，一种是 Historical Ontology，一种是 Ontology of Historical。前者的意思是一种新存在论，就其本性是历史性的，即历史性进入了存在论的核心主题。 马克思之前，黑格尔曾经试图把历史性做成存在论的主题，但我们切勿以为黑格尔的存在论是真正的 Historical Ontology。黑格尔最终把历史置入逻辑之中了，历史的东西和逻辑的东西的统一是黑格尔哲学的原则，殊不知如何能统一。所以一种全新性质的存在论。后者是关于历史的存在论。关于历史的实证的研究非常具体——史学。把历史作为存在论的对象讨论，也可以，比如黑格尔的《历史哲学》，Ontology of Historical。但他的 ontology 本身是 unhistorical 的，他以非历史性的存在论研究了历史。他把人类世界的历史描述成了一个整体，一个过程，主体是文明精神的内核，文明精神展开了几个形态的变化，不是把各个民族的历史分开来看，而是讨论了一个世界通史，对世界通史的存在论研究——这叫历史哲学。实际上，历史是资本主义造成的。黑格尔有一个明确的progress的概念，设定了明确的进步的历程，把不同民族放到这同一历程的坐标上，安放位置。这本身是可疑的。 马克思的历史存在论应该是 Historical Ontology，方法是历史性的，对象也是历史性的，但他一定可以同时做成 Ontology of Historical，《德意志意识形态》里就做了。马克思没用 historical，他用了唯物主义：历史唯物主义。对于历史唯物主义——是关于历史的唯物主义观点还是关于历史的唯物主义存在论。我认为是就是历史存在论-Historical Ontology。 Ontology 可以研究各种对象，但 Ontology 是种什么性质的 Ontology，这是个前提。 对资本主义的存在论思考（在1844年手稿里），是《资本论》的前提。《资本论》为何是政治经济学批判，因为经济学隐藏着的存在论前提的谬误被揭示了。比较集中的批判是借助批判蒲鲁东进行的，在《哲学的贫困》中。有存在论批判即有存在论思想，问题是马克思没把存在论思想完整的端给我们，他的兴趣不在那里。 本课程的教学目的：旨在引导进入马克思哲学历史存在论的境遇，打破近代理性主义存在论的樊篱，学习如何揭示自然事物和社会事物历史性的存在方式，掌握建立历史批判理论的方法论基础。 序言：历史存在论作为一种学说。黑格尔的存在论，如果也称为一种历史存在论，那么只是真正的历史存在论的准备。但他最后不能建立起一种真正的历史存在论，也就是黑格尔哲学的毛病暴露的以后，才为后来发动存在论革命提供了条件，为此要感谢黑格尔。黑格尔的存在论是理性存在论，如何能把人类存在的历史性说出来？黑格尔通过辩证逻辑，即黑格尔的辩证法，完成了历史的东西和逻辑的东西的统一。忘了逻辑的东西，看到的东西全叫现象，没有必然性可言，必然性一定属于理性自身的法则，由此完成统一。 比这个问题更重要的问题是，如何把握存在。黑格尔怎样规定存在？——他的逻辑学不仅仅是关于人类思维规律的学说，同时是形而上学——形而上学和逻辑学的统一。存在论最抽象的形式就是逻辑学。《小逻辑》《大逻辑》就是黑格尔的 Onlology。逻辑学中如何规定存在？——无规定的直接性即存在。一旦有所规定，叫定在。存在成了第一个范畴，但是存在是范畴吗？ 范畴就是最大的概念。比范畴低一层的概念是可以用一种定义公式来定义的，这个定义公式是亚里士多德提供的——一个被定义的东西等于它所属的种加属差。这个公式可以被广泛使用，比如我们为人下一个定义。人=制造和使用工具的动物。动物就是种，在这个种里面有狗有猫、有类人猿、有人，人跟其他动物有个属差——制造和使用工具。最高的种，在上面没有所属的种，就无法定义了。最高的种就是范畴，物质是个范畴。存在是不是最高的种？最初想法是这样，所有事物在明确知道它是什么之前先存在，存在有最大的匹配性。亚里士多德是有智慧的人，他明确说，存在不是种。物质是一个种，包含很多东西。国家的典章制度，归到精神，又一个种。这叫存在者归类。存在算不算一个种呢？存在者 Being-Seiende 可以被归为一个种。但存在 To Be-Sein 呢？存在不可被归类。 存在不是种。可以读读《存在与时间》 导论部分，专门讨论这个问题，很透彻。 海德格尔引用巴斯卡《沉思录》，无论通过直接的解释还是暗示，人都不得不以“这是”开始。一切定义，一切概念总是以‘这是’开始。因此要确定存在-是，汉语显得是两个东西，在欧洲人那里是一个东西。I am ——我存在。现在要定义“是”，又必须要用“是”。当我们问存在是什么，我们在对‘是’发问，是是，存在存在。现在要定义的，恰好是一切定义所不得不用的词。我们到处在说“是”，这显得不是一个问题。看上去是绝对自明的、不需讨论的东西，恰恰是最晦暗、最需要讨论的东西。把自明的、如此不需要讨论的问题拿来讨论，康德讲这叫哲学家的事业。中国人讲，不离日用常形内，直到先天未化前。对于存在-是，第一不可被定义。人们还是想讨论存在的问题，讨论‘是’的学问，就是存在论。 阿奎那《神学大全》：无论一个人于存在者处把握到的是什么，这种把握总已经包含了对存在的某种领会。——存在者被把握，前提是对存在的某种领会。全部问题的要点被阿奎那揭示出来了。意味着我们不能简单把存在和存在者简单等同，to be = being，这种等同从巴门尼德开始，我们以为说存在者就够了，甚至荒谬的以为我们在说存在者的时候，等于把存在也说出来了。存在当成范畴，最高的种——能被思维者与能存在者是同一的。什么叫能被思维，就是把范畴加上去，能被范畴规定者，就是存在者。把对存在的某种领会去掉了，或者说他干脆把对存在者的范畴规定等同于对存在的领会。 我们来看这样一句话：资本家雇佣工人。 存在者都被把握到了。在市场上等价交换的关系，资本家付出一定工资与劳动者一定劳动时间的交换。工人-出售自己劳动的人。资本家-以部分资本购买劳动的人。用雇佣把握了存在者，雇佣意味着对存在的某种领会。 我们再换一句话：资本家利用资本行使他对劳动的支配权。这是马克思《1844年经济学哲学手稿》中的话。资本是权力。存在者看上去是相同的，这是对同一件事情的两种讨论，一种讨论是经济学的讨论，一种是《资本论》的讨论。 海德格尔说，无论我们怎样讨论存在者，存在者总已经是在存在已先被领会的基础上才被领会的。 前者被领会为雇佣，后者被领会为支配他人生命时间的权力。 海德格尔紧接着说，存在者的存在，不是一种存在者。 假如我们不把存在者与存在区分，我们就只知道一种言说是真实的——资本家雇佣工人——这是资本家和工人这两个存在者的唯一真实的言说。我们这样想时，我们就把资本家这个存在者跟他的存在直接等同，于是其他的言说都被排除了，或者认为是荒谬的，其实那种言说是对存在的某种领会。我们今天如果不学马克思的学说，我们只有一种言说，就是资本家雇佣工人。我们认为这是一个事实。我们知道客观事实，在客观事实之外另说什么全是扯淡。马克思说，这是什么呢——资本家利用资本，行使劳动的支配权。换言之，资本就是权力。人支配人的权力。而经济学把雇佣这个事实直接当成存在。如果真是等价交换，我们就不知道资本是怎么增殖的。什么叫不变资本，它不会增殖的。生产资料所代表的价值是全部或分期分批转移到产品上去的。资本家在商业上有能力有预见，但从社会总财富上看，不会增加什么。当我们把存在者当成存在时，我们遗忘了这种存在者是我们对存在的一种领会。 只有我们真的看明白了托马斯·阿奎那的这句话，我们才明白真的需要一门学问，这门学问不是停留在存在者上的学问。 物理学的基本范畴：质点和力。进入物理学的学习，就意味着进入对自然存在者存在的一种领会中去。这种领会造成了这一大堆存在者的范畴规定。然后我们就把他等同存在。 存在论不是关于诸存在者的学说，是关于存在的学说。存在者总是被放到范畴中。 海德格尔，艺术是什么？艺术使存在者的存在得以澄明。所以海德格尔把艺术、宗教、哲学，都看成真理的事业，而不是关于存在者的知识的事情。 把握这个存在者，那个存在者，这是认识活动。我们对存在者的每一种把握都已经包含了对存在的某种领会。假如我们把对存在的领会统统拿掉，专门研究这种领会的根据，原出于什么，这种研究叫存在论研究。 马克思对存在的领会的方式，就是他的存在论思想。马克思存在论如何是场革命？马克思的存在论与之前有何根本不同？ 马克思之前的存在论有五种：1、开创存在论，巴门尼德，存在即思维，思有同一性。2、存在即理念（理式），柏拉图，物质非存在（不是不存在，而是与存在无关），事物是半存在（分有理念），理念是存在。3、存在即是被感知，贝克莱。4、存在即物质，和柏拉图相对，近代唯物主义，物质是世界多样性的统一。5、黑格尔，实体即主体，存在就是作为主体的实体。范畴是实体，同时是主体，自己产生自己，自己展开自己。现实是理性的构造活动。认识活动构造自己的对象。只有在前黑格尔水平，才会认为认识的对象在认识之前就存在。认识对象首先是认识活动构造出来的，这堪称认识活动，否则叫反应，反应不是认识。对象堪称现实，它是理性构造的。 这五种存在论意味着欧洲思想曾经到达的境界，要懂也不容易。","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"存在论","slug":"存在论","permalink":"http://21w.space/tags/存在论/"}]},{"title":"《1844手稿》第三讲","slug":"[哲学]2017-4-18手稿第三讲","date":"2017-04-19T09:08:47.447Z","updated":"2017-04-20T08:32:30.203Z","comments":true,"path":"2017/04/19/[哲学]2017-4-18手稿第三讲/","link":"","permalink":"http://21w.space/2017/04/19/[哲学]2017-4-18手稿第三讲/","excerpt":"","text":"国民经济学的谎言国民经济学，也就是政治经济学。亚当·斯密——国民经济学之父。 首先，从国民经济学的理论出发，在国民经济学的眼界之中，得出劳动价值规律与工资规律的悖反。 工资决定于资本家与工人之间的敌对斗争。胜利必定属于资本家。劳动与资本的分离对工人来说是致命的。工人要出卖自己和自己人的尊严，只有出卖给谁的自由，没有不出卖的自由，因为工人，只有作为工人才作为人。不管市场供需如何、资本家赢利与否、社会财富增长与否，工人总是不利，贫困持续不变。最终工人获得的工资，实际上只是产品中最小的、没有就不行的部分，也就是说，只得到他不是作为人而是作为工人生存所必要的那一部分以及不是为了繁衍人类而是为繁衍工人这个阶级所必要的那一部分。所以工资规律的结论，工资是维持工人生存及其种群不致死绝的最低花费。 而国民经济学家又告诉我们，劳动的全部产品本来属于工人，资本无非是积累的劳动。“现在让我们站在国民经济学家的立场上，并且仿效他把工人的理论和实践要求比较一下”，从这里开始指出国民经济学自身的矛盾。 资本的原始积累是无法通过资本原则自身获得的。“资本来到世间，从头到脚，每个毛孔都滴着血和肮脏的东西”。西方的是殖民地和鸦片，共和国的是第一代农民。深挖洞广积粮——以战争的名义，低价收取农民粮食。 国民经济学家将资本原则表达为自洽的东西。自洽的方式是——人性本贪、资本竞争。对此，可以考察行会和垄断。行会是行业的自我保护。垄断是无竞争，获得定价权，是竞争的结果。 从“现在让我们超出国民经济学的水平，试以前面几乎是用国民经济学家的原话所作的论述中来回答以下两个问题”开始，以超出国民经济学的眼界讨论。 这两个问题是：1、把人类最大部分归结为抽象劳动，这在人类发展中具有什么意义？2、希望提高工资改善工人阶级状况和把工资平等看作社会革命的目标，犯了什么错误？ 对于第一个问题，劳动抽象化，劳动作为工具和手段出现，而不是作为人的本质出现，这既是进步，又是灾难。 对于第二个问题，提高工资和工资平等都不超出资本原则。马克思说，我们的任务不是提高工资，而是消灭工资。即以扬弃资本原则为目标。 一些课堂例子重商主义，是资本原则上升阶段的产物。流通产生价值，要放到历史语境中去理解，当物并未完全进入流通领域，非商品转化为商品，从无到有，自然产生了价值。重农主义是在资本原则取得地位，老贵族阶级与资产阶级谈判的产物。 关于非商品转化为商品。《三峡好人》讲述了三峡移民的故事。从商品价值的眼光看，般迁是件求之不得的事情。而对于原住民来说，土地是祖祖辈辈繁衍生息的地方，是挥洒过汗水、泪水和鲜血的地方，不是待价而沽的商品。 经济学是邪恶的。如果一个人有六个面包，吃一个就饱了，并且每天都会再获得六个。而旁边一个人身无分文，快要饿死了。如果拿着六个面包的人用资本逻辑思考，一个面包值2美元，没有给我2美元交换，不给快要饿死的人面包反而是天经地义的事情。 捐款，实际上是消业，是在为系统正常运行买单。隐性地购买资本原则得以运行的前提。 家庭、市民社会、国家，每一个伦理实体都先于资本。正如一个段子，一个煤老板，花再多钱也无法买到一件事——换掉天安门上的画像。因为他无法购买使这一购买行为得以成立的前提。买卖发生的前提是国家。 市民社会是个翻译的问题，原意是指资产阶级社会。区别于资本主义社会，资本主义社会是资产阶级占统治地位的社会。","categories":[],"tags":[{"name":"蔡剑峰","slug":"蔡剑峰","permalink":"http://21w.space/tags/蔡剑峰/"},{"name":"手稿","slug":"手稿","permalink":"http://21w.space/tags/手稿/"},{"name":"马克思","slug":"马克思","permalink":"http://21w.space/tags/马克思/"}]},{"title":"存在的勇气·第三讲","slug":"[哲学]2017-4-11存在的勇气·第三讲","date":"2017-04-13T12:55:27.349Z","updated":"2017-04-14T12:19:56.512Z","comments":true,"path":"2017/04/13/[哲学]2017-4-11存在的勇气·第三讲/","link":"","permalink":"http://21w.space/2017/04/13/[哲学]2017-4-11存在的勇气·第三讲/","excerpt":"","text":"巴雷特在《存在主义的问世》中总结道，存在主义光谱复杂而性质单一。存在主义，作为一个思想流派，新教徒、犹太人、天主教徒、甚至无神论者等等各种背景的存在主义者，毫无违和地同处其中。他们的思想也各不相同，常见的误解是将某一位存在主义者的思想当作存在主义。比如因为尼采说上帝死了，得出存在主义诞生于超感性世界崩塌之后。或者把存在主义和萨特学派混同，实际上萨特学派只是存在主义极细微的一个片断。单一的性质是，对于存在主义者而言，“宗教的意义及宗教信仰是因人而异的”。个性，始终是存在主义者的关键词。 再谈到萨特，这是由于人们对他过份熟悉，也过份高估。萨特的哲学成就，远远配不上他的社会影响力。海德格尔从来就瞧不上萨特的哲学。当人们把他与萨特同称为存在主义时，海德格尔回应道：如果萨特是存在主义，我就不是。萨特的戏剧，要比他的哲学有价值。萨特的哲学思想：存在先于本质。把存在变成空空的容器，本质是溶液。这个本质指向黑格尔所说：本质，就是作为本质的本质。如评价欧洲反犹传统——反对犹太人的情绪，先于理由。这样说有其合理性，问题在于，对于感性活动来说，把理性的理由拿掉，并非空无内容的容器。 补充关于左派右派的知识。可以用毛泽东的说法，过犹不及，过是左，不及是右。衡量过还是不及的尺度，就是那个占统治地位的思想。西方的左派右派，与中国的有着相反的特性，左派往往有着反政府的一面，右派保守。 关于神学与哲学。在欧洲，没有神学院的大学不能称之为大学。哲学长期是神学院下的一门。很长时间里，哲学作为神学的奴婢存在。哲学的意义成了用理性为神学辩护，因而有理性神学。于是在漫长的中世纪里，思想的进展空乏贫困。中世纪的神学家，严肃讨论的是针尖上站几个天使。听到夜莺美妙的啼叫，转身就讨论要如何杀掉这个恶魔的使者，因为夜莺竟然提供感性的享受。上帝是无质料、超感性的，这种分离从巴门尼德开始——轻的向上重的向下。这一分离同时带来价值的观念，肉体、感性是重的，是向下的，腐败的，堕落的，消极的，灵魂、上帝是轻的，向上的，积极的，高贵的，完美的。用爱情来对比，轻的对应柏拉图式爱情，重的对应有血有肉的活生生的爱情。前者扬弃对象，后者是对象性的存在——“人是受动的存在，因此是有激情的存在”。而神是绝对主动的，因而也是乏味的。灵肉分离是经过漫长的中世纪完成的。 马丁·路德，反对那个教会共同体，却把教会移到每个人的心中，使每个人都变成了僧侣。反对教会不等于反对上帝。 通过与物质的隔离，获得物质的满足。一个青年人，或多或少或早或晚，都是一个斯多葛主义者。追求淡泊，不受外物影响，内在圆满。 尼采说人生最重要的三件事，健康的身体，优雅的外表，通过双手劳动创造财富。要有丰富的生活才能体会这话的重量。 严厉的评价，存在主义者没有一个是健康的，都是病态的。 任何理由都提供一种相反的希望。判断和决断的区别是，前者通过理由得出，后者甚至不需要理由。 存在的勇气，是“不顾一切肯定自我”。这个不顾一切，不是不顾某个具体的事物，而是就其无根据而言。就是在无根据，无法认识的，没有理由的情况下，柏拉图主义者说‘不能’之际，说一句——去你妈的，老子就是要存在。","categories":[],"tags":[{"name":"存在主义","slug":"存在主义","permalink":"http://21w.space/tags/存在主义/"},{"name":"存在的勇气","slug":"存在的勇气","permalink":"http://21w.space/tags/存在的勇气/"},{"name":"蔡剑锋","slug":"蔡剑锋","permalink":"http://21w.space/tags/蔡剑锋/"}]},{"title":"存在的勇气·第二讲","slug":"[哲学]2017-3-14存在的勇气·第二讲","date":"2017-03-20T14:21:54.659Z","updated":"2017-04-20T08:43:39.844Z","comments":true,"path":"2017/03/20/[哲学]2017-3-14存在的勇气·第二讲/","link":"","permalink":"http://21w.space/2017/03/20/[哲学]2017-3-14存在的勇气·第二讲/","excerpt":"","text":"第二次课继续上次《存在主义的问世》的领读。 黑格尔哲学，虽然在其死后从一种官方正统的地位，一坠而为被一致攻击的目标。甚至由于马克思公开追认黑格尔为自己的老师的缘故，一度在西方国家被限制传播，典型的萨特就缺了这一课。正如被奉为正统的黑格尔哲学并非其真实的鼎盛状态，被攻击与被遗忘也不代表其哲学的消逝。恰恰相反，我们正处在一个那种哲学的时代，黑格尔哲学走出他的书面形式呈现在我们面前。这个时代不需要哲学，因为我们就在那种哲学当中。这里谈到复旦大学哲学系险些被取消的往事，不胜唏嘘。 上次提到了，对黑格尔的批判或者说反对可以分成两条路，存在主义和存在论。然而此两种都有着悲惨的命运，一个被普遍的误解（《哲学家足球赛》改成马克思最后也未能上场就符合这种现实了），一个则只能在边缘化的个人中间流传。这个时候人们普遍需要一种思想，填补巨大的空缺。于是英美原则举着反对那种哲学的口号上场了。然而，英美原则只是高卢日耳曼原则的一个延续罢了。他用一把奥卡姆的剃刀，剃掉了一切“不实用”东西。技术的原则与资本的原则占据了统治地位，而对存在问题则是冷漠的。 关于英美原则的自由平等法制，可以思考巴黎爆炸案巴丢演讲、《自由·平等·博爱》……关于人道，《黑雨》。无人机刺杀…… 希特勒，其实是一次对英美原则的浪漫的反动。这样说可能会被误解成在夸奖希特勒，或为其辩护。但这里的浪漫并非一个褒义词，不能正面现实，不解决问题才称其为浪漫。这次反动的失败，加速了英美原则的扩张。今天的世界，英美原则已经完全确定其统治地位。反映在我们国家，表现为国学的失落。表面看社会上兴起所谓“国学热”，不过是把国学作为精神鸦片一样的东西，疗伤过后继续投入到那种原则中去。诸如此类的事情还有很多，例如时下热门的诗歌大赛，不过是另一个最强大脑罢了，比的是科学知识，跟诗歌没什么关系。 我们越发处于一个被定制的时代，从胎教开始，分毫不容浪费的定制着我们和我们下一代的一生。我们看上去自由，但连穿衣都不自由，一个典型的表现——制服。制服的英文：uniform，统一形式。我们迷信科学技术，以此解决一切问题。而亚马逊网站的推荐算法的例子则告诉我们，机器，借用的是人的判断。 再谈到存在主义进入美国，可以对照80年代初开放的中国。很热，但流于表面。文革中毛完成了两件至关重要的事，一是三个世界理论，一是中美建交，这些为改革开放奠定了基础。开放之后，西方思想一股脑同时进来了，高校之中气氛很活跃，但是不应被高估——生吞活剥了西方文化是当时的注解。生吞活剥是会消化不良的。 宏大的字眼被消解，我们从一个广场时代，进入了菜场时代。每个人守着自己的一个菜摊子叫卖。解构主义，实证主义大行其道。实际上人们普遍处于失语的状态，即不愿意被人代表，也不敢去代表别人。如伽达默尔所言，进入二十一世纪，人们变成有意识的退了出来。 存在主义思潮有其病态的一面。关乎的是个人的存在，甚至拒斥集体与国家。存在主义者表达个人感受，变成基督徒谈论宗教体验一般。但是审美是不等与口味的。人作为类而存在，我们的语言是共同使用的，我们以语言之家为家。 萨特只是存在主义的一面。他是法国社会活动家，社会影响力很大，死时四十万人送行。他的戏剧很好。 反对理性主义，于是退到感性中去。这实际上正是承认了理性主义的原则，把思想的地盘拱手让给自己的对手。 实际上，我们应该“比理性主义者更深刻地思考”。———海德格尔 最后一点时间，我们打开了《存在的勇气》，简短的介绍了作者蒂利希其人。神学家，相较其他存在主义者，理论修养比较深厚。存在主义在哲学中是奇葩，他是特例。","categories":[],"tags":[{"name":"存在主义","slug":"存在主义","permalink":"http://21w.space/tags/存在主义/"},{"name":"存在的勇气","slug":"存在的勇气","permalink":"http://21w.space/tags/存在的勇气/"},{"name":"蔡剑峰","slug":"蔡剑峰","permalink":"http://21w.space/tags/蔡剑峰/"}]},{"title":"磁盘自动同步","slug":"[折腾]sync&任务计划搭建自动同步","date":"2017-03-05T02:45:24.040Z","updated":"2017-04-14T12:21:09.220Z","comments":true,"path":"2017/03/05/[折腾]sync&任务计划搭建自动同步/","link":"","permalink":"http://21w.space/2017/03/05/[折腾]sync&任务计划搭建自动同步/","excerpt":"","text":"但凡对硬盘资料的重要性、硬盘存储的不可靠性及恢复成本的昂贵有所认识，都会将硬盘重要资料备份。备份的方式有很多，常见的百度云，Dropbox等等，可以归为云备份。云备份的优点很多，但在脱网的情况下就完全失效了，而且当前云备份还有很多缺陷。除此以外最好的办法，我认为是本地硬盘备份——比如常备一块移动硬盘或多台计算机互联，保持重要资料同步备份。在适用性方面，我认为云备份是无可比拟的，但在便捷性和安全性方面，还是本地硬盘备份更好。手动方式费时费力，不适应长期工作。所以找到一个便捷可靠的自动备份方案就很重要了。 本文记录使用SyncToy，以及windows系统自带的‘任务计划’ 功能，实现便捷的自动同步——当读取到移动硬盘连入时，自动同步指定文件。也可按此方法类似地实现多种备份。使用系统window10，64位。经过使用发现本方法操作简单，但功能强大。 自动备份软件很多，选用SyncToy的原因：Microsoft推出，可靠，免费，功能简洁，无限制。 首先安装SyncToy。本文采用SyncToy2.1 创建同步方案。创建方案名称为test。定义同步方式（可以选择双向、单向及安全方式三种）。还可以设置过滤参数。SyncToy功能与设置不做赘述。 创建任务计划。插上移动硬盘，在事件查看器中找到对应事件。如图，找到相应事件——右键‘将任务附加到此事件上’——填写名称与描述、下一步、下一步——选择’启动程序’操作、填写启动程序参数——下一步、完成 完成。弹出，重新插入测试，自动完成同步。","categories":[],"tags":[{"name":"SyncToy","slug":"SyncToy","permalink":"http://21w.space/tags/SyncToy/"},{"name":"自动备份","slug":"自动备份","permalink":"http://21w.space/tags/自动备份/"}]},{"title":"《存在的勇气》第一讲-概录","slug":"[哲学]2017-2-28存在的勇气1","date":"2017-03-01T06:09:04.915Z","updated":"2017-04-28T02:31:32.466Z","comments":true,"path":"2017/03/01/[哲学]2017-2-28存在的勇气1/","link":"","permalink":"http://21w.space/2017/03/01/[哲学]2017-2-28存在的勇气1/","excerpt":"","text":"《雪》-巴乌斯托夫斯基 黑格尔要了解存在主义，首先不得不先了解黑格尔。“黑格尔所意指的，不是形而上学之一种，而是形而上学之一切。”（《天津社会科学》，1999年，第6期，《论马克思哲学的当代性》，吴晓明）这里的形而上学，即柏拉图以降的理性主义，整个柏拉图主义。 海涅问：黑格尔先生，难道你就看不到满天的繁星？黑格尔：什么满天繁星，那不过是万里无云的理性天空的疮疤。绝对精神的历史车轮滚滚前进，个人只是沿途无关紧要的花花草草。##出处？## 黑格尔死后，留下巨大的思想空洞，长长的阴影。掀起激烈的反黑格尔思潮，从以读黑格尔、学黑格尔为荣，转变成贬黑格尔为荣。类似遭遇的的人物很多，比如毛泽东。 在后黑格尔时代，反对黑格尔的思想可以归为两个方向。一派即以马克思、海德格尔为代表的生存论（或说存在论、本体论）的方向，一派是存在主义方向。 存在主义推荐存在主义代表作品：《非理性的人》威廉.巴雷特、《存在主义》考夫曼。前者认存在主义之始为陀氏，更注重评论性，后者认为文摘性更强。本课程用《非理性的人》第一章《存在主义的问世》作为存在主义的背景介绍。 克尔凯郭尔（祁克果）。直观感受到现代性的人的无家可归的状态，反抗理性，就像一个叛逆的孩子。连墓志铭都要写上：“那个个体” ，以示对黑格尔的理性的反抗（出处？）。克尔凯郭尔讲过这样一个故事：有一个人对自己的生活从来漫不经心，甚至不知道自己究竟存在还是不存在，结果在一个风和日丽的早晨一觉醒来，他突然发现自己死了。只有在他死的时候，才发现自己的存在。对应流行的”老男孩”，那些年，都是浪漫主义。所谓浪漫主义，就是面对现实问题，向过去逃避，它很感性，很打动人，但不解决实际问题。 死亡。死，是对存在的关切，是哲学的缪斯，是对人有意义的最大的成全。没有思考过死亡的人，“从未遭遇虚无”-王德峰。 &lt;!- “人荒诞地存在在荒诞的存在之中，我们谓之自由的东西，不过是对这种存在的徒劳的探寻”（《灵魂是不能被遮蔽的事物》序言，陈行之）。 –&gt; 陀思妥耶夫斯基。“存在主义之父” 。蔡认为最好的作品《白痴》《被侮辱与被损害》。文学特点，小人物，个性特点，对体制卑微的、失败的、可歌可泣的反抗。存在主义者们就像是从陀氏作品中走出来一样。缺点，独白太多，总是借文学表达自己的思想。陀有一次濒死体验，之后思考：一个人恐惧死亡，到底恐惧的是什么？不是死亡本身，而是那种等待。后期提出，宏大本身就是问题，而不是在左边还是右边。俄国文学的特点，宏大。特例，巴乌斯托夫斯基（也有翻译成帕乌斯托夫斯基），作为俄国文学宏大风格的特例–《雪》。 &lt;!-在这个莫名其妙的世界上，无论怎么叫人发愁，它总还是美丽的……帕乌斯托夫斯基《伊凡·蒲宁》题记 –&gt; 存在主义是失败的浪漫反动，只能归结为一种思潮，是一种类似孩子气的叛逆。存在主义中各个人物思想各不相同，具有个性化的特点。他们的作品极具文采，因为他们正是以感性来反对理性。代表人物有：萨特、加缪、波伏娃。 存在主义的问世《存在主义的问世》实在是总体介绍存在主义极好的文本。以下是一些关键词说明。 理性。日光普照，在西方思想中，指理性。类比中国的月亮，故乡，不是月亮象征故乡，而是看到月亮，看到的就是故乡。 轴心时代，苏格拉底柏拉图、论语孟子，著作都是对话体的形式，离不开语境，这是不同于教材和其他书本的。 现代性。政府的力量，非典，上海，比较。人们趋同，碎片化时间。 对当代的态度，狄更斯，这是最好的时代，这是最坏的时代…… 职业化。profess，表白，带有宗教、信仰意味。profession，职业的，专业性的畸变，狭隘，对超出领域的无视、无知。例子，中马西马，马克思前期晚期，医生我不跟病人以外的人说话，心理医生no relationship，职业教师机械重复。当今的高校，实质是高等职业培训所，以就业率衡量。 总结。面对现实困境的三种解决方式——逃向过去，逃向未来，立足现实。逃向过去，哲学上，卢梭，回归原始社会，浪漫，文采好（休谟，观点争锋相对，但赞叹卢梭的文采；康德，如钟表规律的生活，被卢梭的爱弥儿一文打乱）。逃向未来，乌托邦，把共产主义误解成未来理想社会、乌托邦主义，代表人物弗罗姆。立足现实，马克思。 《非理性的人》存在主义的问世：","categories":[],"tags":[{"name":"存在主义","slug":"存在主义","permalink":"http://21w.space/tags/存在主义/"},{"name":"邝言","slug":"邝言","permalink":"http://21w.space/tags/邝言/"},{"name":"概要","slug":"概要","permalink":"http://21w.space/tags/概要/"}]},{"title":"德意志意识形态课程-导言","slug":"[哲学]《德意志意识形态》1.导言20160905","date":"2017-02-18T13:27:02.221Z","updated":"2017-03-11T01:36:49.758Z","comments":true,"path":"2017/02/18/[哲学]《德意志意识形态》1.导言20160905/","link":"","permalink":"http://21w.space/2017/02/18/[哲学]《德意志意识形态》1.导言20160905/","excerpt":"","text":"录音地址：德意志意识形态课程-导言1 哲学学习的方法学习哲学的两个要点：原著、哲学史，这是哲学学习和理论修养的基本功。没有原著的研读，对哲学的了解是空洞的；而哲学史不是一个名人录，哲学史是线索，是问题展开的历史。在线索中理解每一个发展环节中的代表作品。 引用黄凯向郑中达学说文解字的事例，告诫学习需要下功夫。马克思：科学的道路上就是不平坦的…… 马克思学说–继承和批判马克思学说的主体就是历史唯物主义，不仅是种历史观，而且是存在论。国内国际，真懂历史唯物主义的人寥若晨星。谁算懂的？海德格尔接近了，还是没有真懂，没有抓住历史唯物主义最根本的。他批判马克思，晚年有一个三天讨论班，集中对付马克思《关于费尔巴哈的提纲》。我们可以看到海德格尔还没懂马克思。第十一条，哪一次世界的改变不以对世界的重新理解为前提呢？海德格尔自认为很懂马克思，所以把胡塞尔贬了一下，把萨特贬了一下。我念一段原话，海尔格尔在《关于人道主义的书信》中提到马克思—— “马克思在基本而重要的意义上，从黑格尔那里，作为人的异化认识到的东西，和他的根子一起不归为新时代的人的无家可归的状态。” 这句话他承认马克思从黑格尔那里得到很大启发。马克思的三个来源：黑格尔、费尔巴哈、？（应为德国古典哲学，英国政治经济学，法国革命运动）。究竟从黑格尔那里获得了什么？海德格尔抓住了要点——从黑格尔那里作为人的异化认识到的东西，就是马克思在基本而重要的意义上，把握了异化这件事。但是，这个异化的根子是什么？从人的异化认识到的东西，这个认识到的东西是什么？上下文没有明说。实际上是抽象劳动的主体化。 人力资源，就是典型的人的异化的表现。什么创造了人的异化？——马克思抓住了抽象劳动的主体化。抽象劳动主体化的根子是什么？从海德格尔上下文，他说的这根子就是对世界（对自然界、对人）的技术的态度。新时代指资产阶级时代。 “因为马克思在体会到异化的时候，深入到历史的本质性一度去了” 历史的本质性——历史不仅是一种现象，把历史当作一种现象，也是一种哲学观点，历史的本质性，有谁进去过吗？黑格尔似乎进去过了，黑格尔的辩证逻辑（正反合）是不是进入了历史的本质性，理性自身的正反合的构造就是人类历史过程的根据，所以黑格尔似乎第一次在存在论或本体论中把历史性作为存在性的主题，但还是没有深入到历史的本质性的一度。而海尔格尔在这里承认，马克思在体会到异化的时候，深入到历史的本质的一度中去了。一度或说一维，dimensional。所以马克思关于历史的观点，比其余的历史主义（以往的各种历史理论）优越。 “但因为胡塞尔没有，萨特也没有在存在中认识到历史事物的本质性，所以现象学（胡塞尔）没有，存在主义（萨特）也没有达到这样的一度（历史的本质性的一度）。在此一度中，才有可能有资格和马克思交谈” 这段话很重要，一方面我们体会到海德格尔的眼光，慧眼，但他认为马克思的学说并没有指出一条人类社会摆脱无家可归状态的出路，而且马克思对技术的不断进步的赞扬，在海德格尔看来，还是落到黑格尔哲学的范围，生产概念变成整个历史唯物主义最基本的概念。这个生产概念其实是黑格尔自我意识概念的唯物主义颠倒，没有摆脱近代形而上学。这是对马克思总的批评。当马克思认为生产的进步会为人类的解放准备好物质的基础和各种社会条件的同时，海德格尔认为马克思又回到了无家可归的状态中。所以对马克思比较高明的批判每每抓住的是这个，其他的批判不足道矣。但他们的批判准确与否呢？他们是否抓到了马克思学说本身，归根到底还在生产的逻辑里面——这样一个现代性的本质规定当中去，你还局限于这个本质规定，你在这个本质规定当中居然要指出一条人类解放的道路，这是否可能？现在对马克思批判的要点就在这里。就像波德里亚写的《生产之境》，也就是批评马克思——你的资本论，自称政治经济学批判，其实根本没完成批判，你还是一种政治经济学。这种思想的根据都来自海德格尔对马克思的批评。 我把这个先拿出来的说，就是表明，我们怎么看待对马克思的继承和批判。两种路子，继承的对不对，批判得对不对？到马克思原著中去。马克思在西方思想史上真是个罕见的人物，它普遍的被误解，包括跟他有伟大友谊的恩格斯，一样误解了马克思。恩格斯对马克思的误解是马克思学说的谬误，而这个人物是如此重要，他不断的被误解或曲解，他的影响又是如此巨大。二十世纪每一个哲学流派出现后不久，很快就会出现这种流派跟马克思主义的加集，弗洛伊德的马克思，现象学的马克思，存在主义的马克思，结构主义的马克思等等。分析哲学清晰了是吧，分析的马克思。难怪萨特感慨说，马克思的学说是二十世纪唯一不可超越的学说。马克思也无需我们为他辩护，我们与马克思的关系是，当代人类还需要从马克思那里得到启发，来应对当代问题。伟大思想家的思想，人类要经历几个世纪才能消化吸收，这是叔本华讲的。面对康德伟大的学说，人类就是难以教导的顽童。 需要历史唯物主义启蒙经济学家是资产阶级的学术代表，这是马克思的原话。现在我们觉得这样的命题太过时了，现在我们对社会科学的研究还要阶级分析吗？社会科学有阶级性吗？没阶级性的呀。科学是客观的，价值是中立的，否则他不能叫科学。各位相信这一点吗？MBO 我们中国的社会科学应该完成一次历史唯物主义的启蒙。现今的社会科学建立在沙滩上，这个沙滩叫范畴体系，但这个范畴体系的根基他们不知道。各种科学都是从出发的，社会学有社会学的一系列基本范畴，经济学有经济学的范畴，法学有法学的范畴，有了这些范畴他才获得他的研究领域。比如说，经济学的核心范畴是什么？价值（值多少钱），不是指使用价值，是指交换价值。没有这个价值范畴，就没有经济事实。利润、利息、工资、地租——这些经济范畴都是价值范畴的不同形态。一个杯子，由于赋予了价值属性，它就由单纯的劳动产品转化为了商品。由价值范畴为核心推演出来的一系列范畴，就有了经济学把握人类物质生活关系的基础。所以经济学一定从范畴出发。什么叫经济事实，比如说雇佣劳动，资本家雇佣了一批工人，你用雇佣二字了，就是经济事实了，资本跟雇佣劳动在市场上的关系叫买卖关系，等价交换——我没有拿鞭子逼你劳动。我们在价值范畴中说话，一条事实，雇佣劳动就来了，雇佣劳动是经济事实，但雇佣劳动的本质真相是异化劳动，那就不是经济事实。你把范畴拿掉，把经济范畴清洗掉，你看到的不叫雇佣劳动（雇佣劳动是公平买卖等价交换，工资，交换都在价值范畴里）。我们很快都要到这种经济事实中去了，我跟复旦大学也是处于这个经济事实中，我跟他签过合同，复旦大学是甲方我是乙方，我那多少岗位津贴都标好的，这真叫价值范畴。但我从来不能接受这一点，我认为复旦大学是我的精神家园，复旦培养了我，让我留校加入学术共同体，这是我的领会，它不是一条经济事实对吧。把人类生活世界中的事实，拿范畴框上去，一弄全变成了科学事实，叫社会科学的事实。社会科学就建立在范畴的基础上。而《资本论》不是经济学，因为它是经济范畴之批判的学问。所以我提倡中国社会科学界，应该重新完成一次历史唯物主义的启蒙。 什么叫历史唯物主义？我们打开《哲学的贫困》第二章第一节，马克思在1847年发表的，讲到：“如果有一个英国人把人变成一顶帽子，那么就有德国人把这顶帽子变成观念，这个英国人就是李嘉图，经济学家，这个德国人就是黑格尔。”，一个非常有趣的比喻。本课选读的文本是《德意志意识形态》，书中最要紧的是《关于费尔巴哈的提纲》。什么叫变成帽子——在复旦大学跟我签那个合同的时候它就把我变成了一顶帽子，这个帽子叫做经济范畴。我去民政局之类的部门办一个护照，这个政府机关就要把我变成另外一顶帽子，给我套上一个法学范畴，叫公民。我是市民社会中的一个市民——社会学范畴，又一顶帽子。就把我王德峰变成诸范畴之总和，那这是我吗？当我恋爱的时候遇到情敌，我们战斗，这才是我呢，它没有范畴规定。现在这个也异化了，你有房子吗，你是雇佣劳动者还是企业家。范畴从哪里来？范畴是思维的基本形式，理性就是范畴思维，那么把理性讲得最清楚的是谁——黑格尔，所以就又把范畴变成Idea——理性的观念，所有经济范畴是从理性的怀抱中生长出来。由此这样一个有趣比喻捅开秘密，社会科学的前提近代西方的理性形而上学（主要是黑格尔哲学）。今天的社会学家都不会研究黑格尔，认为他过时了，但是他暗中以黑格尔的理性哲学做前提。怎么叫暗中，说穿了一个普遍的基本信念——比如经济学家认为他们这门学科是科学，因为他们研究的是人类历史发展到这个阶段唯一合理的经济制度，叫资本主义，资本主义之前的制度都是偶然的谬误，对资本主义进行描述就是范畴，这个范畴是非时间的，就是不朽的，于是资本主义也就是不朽的、永恒的。这就是近代理性形而上学的前提，一切社会科学都以这个做前提，他们没有认真的检省过自己的前提，不知道什么叫历史的存在，他们把历史的存在偷换成非时间的存在——范畴规定。 我们进入《德意志意识形态》的阅读，也就是进入历史唯物主义的初创之作。 思想的分娩。相似的有海德格尔、维特根斯坦。 关于《德意志意识形态》著作者的争论，意义优先于考据。 蒲鲁东，《什么是财产》，财产就是盗窃，地位很高。在哲学领域，黑格尔之后有个费尔巴哈，在经济学领域，李嘉图之后有个蒲鲁东。他发现财产关系不是理性的，盗窃是非理性的。但他只停留在这个发现上。 重要材料与概念学习马克思的历史唯物主义有几本重要的书，《1844手稿》，《关于费尔巴哈的提纲》，《德意志意识形态》这是历史唯物主义的源头，《哲学的贫困》——被称为《资本论》真正的导言，为历史唯物主义哲学（马克思称之为真正的哲学）扫清了道路。 生产关系。生产关系不是经济学概念，虽然经济学家也经常用到这个概念，但纯粹是从经济关系的角度理解，对生产关系给予经济学范畴规定就变成经济关系。经济关系拿掉范畴就是生产关系。人类物质生活关系是非理性的，放入范畴，使之成为理性关系。科学就是命题的输入和输出，把人类生活放入范畴（建模），使之成为命题、事实输入。 我们不能轻易贬低经济学，经济学作为逻辑体系拿来描述当代人类经济生活的清晰性是毫无疑问的，但在这个描述中牺牲了生产关系非理性的本质，在生产领域发生的感性冲突无法用理性表达，无法用逻辑消解。 所以终于，马克思的《资本论》揭示了整个资本主义生产系统、经济系统的逻辑上的非自洽性。所以不能把生产关系和经济关系划等号，经济关系是经济学的研究对象，它的前提是范畴关系，范畴与范畴的关系都是理性的。这里的理性指的是西方哲学意义上的理性，即范畴思维，离开范畴谈不上理性。这个跟中国人的理性不一样，你也可以说儒家学说是理性的学说（因为它不是宗教信仰），但这个理性跟西方几千年发展形成的那个理性不是一回事。第一个范畴的发现者——巴门尼德。 经济关系是理性的关系，但生产关系是理性前的关系。生产关系的真正发现者是马克思，此前无论人们口中如何使用生产关系一词，实质上都是经济关系，指的是范畴之间的关系，经济范畴之间的关系就叫经济关系，马克思第一个发现了生产关系。这个例子说明，《德意志意识形态》这个历史唯物主义的开创之作里面用的概念其实都是存在论概念，我们姑且还用概念这个词。 马克思说过，迄今为止的一切生产关系都是对抗性的。我们曾经假设过原始共产主义，未来人类社会叫真正的人类社会，阶级关系没了，生产关系在，但不再具备对抗性。这个对抗性，不是逻辑上的对抗矛盾，而是感性上的对抗，你消灭我或我消灭你，对抗关系是人与人之间感性冲突关系，感性冲突是不可能用逻辑消解的。只有将明明是感性冲突改造成范畴之间的关系，然后讨论逻辑上自洽与否，矛盾与否，即把一个现实中的感性冲突转换为经济学理论研究的任务。转变成理论研究的任务能解决/改变现实中的冲突吗？不可能改变。中国经济能逃得过今天吗，为什么，不是我们没有经济学理性。调整经济结构是社会斗争，social strive，不是理论斗争，理论斗争是观念对抗，不会死人的。大家开会嘛，温文尔雅，发表不同观点，互相商榷就好了。调整经济结构一定要触动既得利益集团——谁动了我的奶酪，马克思看得很清楚。这就是生产关系，经济学家把它变成经济关系，于是马克思在《哲学的贫困》里说“经济关系只是生产关系的理论抽象”。 这些概念看上去是经验性的概念，其实是历史存在论的概念。生产力也是这样。你把生产力直接读成生产工具，读成技术，你又错了。当然包含技术，但是技术也是人与自然界的感性关系，不过它是technology——是人与自然界异化了的感性关系。加入我们用手艺加工自然物，前资本主义阶段手工业劳动者的手艺，它可不是technology，不是技术，所以这种感性关系不是异化的，那叫天人合一，没有把自然界看成是一大堆material，然后我们用我们的概念生出技术来处理它。我们现在就在一个技术的时代，这个技术当然有用，我们看到技术的普遍运用，深入充分渗透到我们的生活中去，我们就是技术至上主义者。这种技术至上的态度不仅是对自然的态度，而且还是对人与人的关系的态度。现代社会组织都以技术的原则加工，比如企业叫管理科学，实际就是技术手段来组织人与人的关系，构成现代企业制度，这全是technology技术。 技术带给我们很多方便，克服许多问题。比如心脏病，可以弄个支架，反正人就是个machine嘛。 中西医是两种自然观。 技术是一种自然观，艺术是另一种自然观。 我们作了一个铺垫性说明，我们读《德意志意识形态》，是在读一本存在论著作，这个存在论叫历史存在论，又名历史唯物主义。因为历史存在论还有别的主义，这是必要的说明。海德格尔的存在论也是历史存在论，但不是历史唯物主义，因为海德格尔的历史存在论讨论的是在，此在，而且是历史性的。而马克思的历史存在论核心概念是social power（社会权力），社会权力的演变，及演变中的辩证法。社会权力的根据都是服从辩证法的，这个辩证法是感性辩证法，不是概念的辩证法，范畴的辩证法。 这一切都是理解上的准备。","categories":[],"tags":[{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"},{"name":"马克思","slug":"马克思","permalink":"http://21w.space/tags/马克思/"}]},{"title":"关于成长的小事","slug":"[路上]2017-02-11关于成长的小事","date":"2017-02-10T16:00:00.000Z","updated":"2017-10-17T16:14:13.372Z","comments":true,"path":"2017/02/11/[路上]2017-02-11关于成长的小事/","link":"","permalink":"http://21w.space/2017/02/11/[路上]2017-02-11关于成长的小事/","excerpt":"","text":"大概在去年十月份，一边学着JS，一边把这个博客搭好。 解决许多未知的问题的过程中，体会到作为人有所可为的喜悦。同时感到知之甚少，能力有限。 在短暂的喜悦过后，觉得博客还大有完善的余地。比如毕竟还是用的别人的主题，是不是可以自己做一个主题呢？再进一步，对于Hexo是不是也可以搞点事情，要不要也朝着自己做一个的方向努力一下？ 这么一考虑之后，觉得这个博客简直有些让自己蒙羞了。最后主题没做出来，Hexo在更远处，博客也尘封起来。 回顾这个过程，其实能有很多收获。 对我来说，做出这个博客，算是个突破。而在这个领域里，这点提高又不值一提。从更广的角度看，这点提高竟无法再让我感到快乐。 我想这可能是阻碍人持续提高的一个主要原因吧—不能为自己的一点点成长感到兴奋和激动，无法从成长的快乐里获得激励，也就没有持续成长的动力。 回想起之前学囚徒健身，好像仅仅限制在了单一领域。当时体会到每一个简单的动作都应该认真完成，“要榨干每个动作的养分”。真正遇到更广泛的问题，又开始急进浮躁。技艺的精进，总是从一点点小的提高中，吸足养分。成长的每一件小事，也值得认真对待，榨干养分。 最近朋友推荐李笑来的文章，细读了一篇关于“感受细微变化的能力”和“元认知”的文章。其实，跟冥想以及健身都相通，又觉得新有一些领悟。 从控制的角度来说，测量乃是控制的第一步。","categories":[],"tags":[{"name":"感知","slug":"感知","permalink":"http://21w.space/tags/感知/"},{"name":"成长","slug":"成长","permalink":"http://21w.space/tags/成长/"}]},{"title":"山西记","slug":"[路上]2017-02-10山西记","date":"2017-02-10T12:41:16.251Z","updated":"2017-08-18T13:33:41.021Z","comments":true,"path":"2017/02/10/[路上]2017-02-10山西记/","link":"","permalink":"http://21w.space/2017/02/10/[路上]2017-02-10山西记/","excerpt":"","text":"抒情越来越不合时宜，我们玩弄各种自认为高明的把戏逃避着深刻。时间的步伐越来越快，当下的意义越来越匮乏。这个问题也越来越意味深长：人为什么要追求效率？不追求效率，人可以追求什么？ 来这里四个月了，秋夏已尽，隆冬将至。 厂外田地里的高粱和玉米长熟了、收割了，然后放养牛羊，如今坦露着干枯的刚翻耕过的土地。 面对它，想起那首诗——“放弃沉思和智慧，如果不能带来麦粒，请对诚实的大地，保持沉默。”（海子《重建家园》） 愿你也一样，依然饱含对土地的深情和崇敬。离乡的游子，和自大的狂徒，终归大地。 这个室外钢制的楼梯，已经爬过许多遍。阳光照着，洁白如雪。从这里能看到远处的山和夕阳，那是山西的山、格外沉重的山和无法言尽的夕阳。可能是为数不多的，看上去永远比图像更为多彩和壮丽的景象。 尤其动人的，天晴时没有一丝云的痕迹，天空澄净旷远。日光底下走一走，感受得到一切的美好。所谓过往不念，未来不期，正是此时此刻此地，美到无暇他顾，觉得其他一切都是小事。 已经吃惯了这里粗厚的面条，习惯了吃饭倒一小碟醋，每一顿总也离不开烩菜，更是对这里火爆的服务员们习以为常，还有晋语特殊的音律。到他乡旅游几日，和生活几个月截然不同，后者才能真正以面对生活的态度面对那里的林林总总，方能品尝出一处山水一处生活的滋味。 从书本上读到中华民族发祥地，终究只是一个标签、一个知识点。看到这里的古迹，听当地人讲貂蝉，讲大槐树，意识到自己的祖辈就在这片土地上出生、劳动、出走。再看这片土地时，能看到肉眼看不到的东西——譬如人的生生世世，民族命运的悲喜。在上海呆得久了，谈话仿佛离不开几百万的房子。到山西生活几个月，如同穿越了时代。 这又是一所精神与时间的房子，在这里，经历着想要放弃生命的难过，与欢喜宁静自得自足，反反复复。时而哼着歌，蹦蹦跳跳，时而痛苦得叫了出来。可怜的自我折磨的灵魂，同时又自得其乐。 在这个房子里的一切，都留在了房子里。兴致勃勃地做了自己的博客，做了一个用来表白的精美网页，最后又都留在这个房子里。没日没夜的看康德和马克思，为一点理解而欢喜，为理解无能而痛苦，也都留在了这个房子里。 这个房子就是我，喜与悲，终究困在我之内。关于我，总是在自我拷问，总是哑口无言，无法回答。 和上次与之前的每一次一样，一个人来，一个人生活，一个人离开。没有故乡或异乡，只有精神与时间的房子、将离之地和将往之地。","categories":[],"tags":[{"name":"行记","slug":"行记","permalink":"http://21w.space/tags/行记/"},{"name":"山西","slug":"山西","permalink":"http://21w.space/tags/山西/"}]},{"title":"重装系统后的博客系统恢复","slug":"[折腾]重装系统后的博客系统恢复","date":"2017-02-08T13:22:06.863Z","updated":"2017-02-08T14:32:18.794Z","comments":true,"path":"2017/02/08/[折腾]重装系统后的博客系统恢复/","link":"","permalink":"http://21w.space/2017/02/08/[折腾]重装系统后的博客系统恢复/","excerpt":"之前乱进网站，电脑中毒了，Chrome浏览器启动程序被篡改，主页挟持。小胳膊拧不过大腿，无奈重装。 重装后博客系统的恢复一直搁置，直到今天花了一个小时搞定，比想象中要顺利。","text":"之前乱进网站，电脑中毒了，Chrome浏览器启动程序被篡改，主页挟持。小胳膊拧不过大腿，无奈重装。 重装后博客系统的恢复一直搁置，直到今天花了一个小时搞定，比想象中要顺利。 1、首先安装Github，因为之前有离线安装包，重新安装十分方便。安装好后登陆Github账号即可。2、重新安装node.js node -vnpm -v检查node.js环境安装成功 3、重新安装hexonpm install hexo-cli -gnpm install hexo –savehexo -v重新安装hexo，及检查 hexo init初始化 npm install安装需要的组件 将原有备份的hexo文件夹中，themes 、sources文件夹及_config.yml文件移至新文件夹 hexo d 发布遇到错误提示：ERROR Deployer not found: Git解决办法：输入npm install hexo-deployer-git –save hexo d 发布遇到错误提示：FATAL fatal: Not a git repository (or any of the parent directories): .git解决办法：git init 生成一个.git隐藏文件夹，将这个文件夹移至.deploy_git文件夹，发布成功。","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://21w.space/tags/hexo/"},{"name":"github","slug":"github","permalink":"http://21w.space/tags/github/"}]},{"title":"博客搭建过程","slug":"[折腾]博客搭建","date":"2016-11-04T10:35:02.477Z","updated":"2016-11-05T10:59:57.113Z","comments":true,"path":"2016/11/04/[折腾]博客搭建/","link":"","permalink":"http://21w.space/2016/11/04/[折腾]博客搭建/","excerpt":"","text":"Nodejs &amp; Gitnodejs 可以很方便下载安装. git 由于服务器原因,安装包无法下载成功,github 桌面版同样如此.幸而找到 github离线包 安装github桌面版可以省去设置 1.ssh 2.用户名和邮箱 github 桌面端 setting 中可以将 default shell 改成 git bash . Hexosource 文件夹中可以根据需要添加东西,比如 CNAME . 本地测试 http://localhost:4000/ hexo根目录下 _config.yml 和主题包下 _config.yml 要区分 域名这个域名很便宜 SSH 测试遇到的问题12$ ssh -T git@github.comssh_exchange_identification: read: Connection reset by peer 参考 ssh 排错经验用 ssh -v 测试 123456789101112$ ssh -v git@github.comOpenSSH_6.6.1, OpenSSL 1.0.1i 6 Aug 2014debug1: Reading configuration data /etc/ssh/ssh_configdebug1: /etc/ssh/ssh_config line 1: Applying options for *debug1: /etc/ssh/ssh_config line 5: Applying options for github.comdebug1: Connecting to github.com [192.30.253.113] port 22.debug1: Connection established.debug1: identity file /c/Users/L/.ssh/github_rsa type 1debug1: identity file /c/Users/L/.ssh/github_rsa-cert type -1debug1: Enabling compatibility mode for protocol 2.0debug1: Local version string SSH-2.0-OpenSSH_6.6.1ssh_exchange_identification: read: Connection reset by peer 可以判断是服务器出了问题.搭梯子:123$ ssh -T git@github.comWarning: Permanently added &apos;github.com,192.30.253.112&apos; (RSA) to the list of known hosts.Hi username! You&apos;ve successfully authenticated, but GitHub does not provide shell access. 毕竟小白,实际过程艰辛感人. 比如因为 SSH 的问题把所有软件重新装了一遍. 参考资料主要参考:史上最详细的Hexo博客搭建图文教程Windows搭建自己的独立博客","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://21w.space/tags/hexo/"},{"name":"github","slug":"github","permalink":"http://21w.space/tags/github/"}]}]}