{"meta":{"title":"贰十一万","subtitle":null,"description":null,"author":"贰十一万","url":"http://21w.space"},"pages":[{"title":"","date":"2017-04-14T09:56:20.479Z","updated":"2016-12-17T01:48:11.659Z","comments":true,"path":"loveyou/1.html","permalink":"http://21w.space/loveyou/1.html","excerpt":"","text":"html body{overflow：hidden;margin: 0;display: block;} body{ font-family: 'Open-Sans','Helvetica Neue','Hiragino Sans GB','LiHei Pro',Arial,Sans-serif; } #wrapper{ position: absolute; width: 400px; margin-left: -210px; margin-top: -150px; top: 50%; left: 50%; text-align: center; -webkit-user-select: none; -moz-user-select: none; user-select: none; } h1{ /*font-family: 'Open-Sans','Helvetica Neue','Hiragino Sans GB','LiHei Pro',Arial,Sans-serif;*/ font-family: 'Montserrat','Helvetica Neue',Arial,Sans-serif; font-weight: 700; font-size: 30px; letter-spacing: 9px; text-transform: uppercase; margin: 12px; } h2{ color: #999; font-weight: normal; font-size: 16px; letter-spacing: .11em; margin-bottom: 30px; left: 3px; } h1 h2{ position: relative; } p{margin: 0;} a{ font-size: 14px; line-height: 2em; margin: 0; letter-spacing: 2px; color: #999; text-decoration: none; } canvas{position: absolute;pointer-events: none; top: 0; left: 0; z-index: 0; width: 100%; height: 100%;} love You Who came to me when the world was gone&#63; I find thee I'm Safe &amp;Strong &amp;Glad 致某某 // document.addEventListener('touchmove', function (e) {e.preventDefault()}) var canvas = document.getElementById('canvas'); if (canvas.getContext){ var ctx = canvas.getContext('2d'); var dpr = window.devicePixelRatio || 1; var width = window.innerWidth; var height = window.innerHeight; var f = 90; var q; var color = 0; var m = Math; var pi = m.PI*2; var v = m.cos; var rand = m.random; canvas.width = width*dpr; canvas.height = height*dpr; ctx.scale(dpr, dpr); ctx.globalAlpha = 0.4; } function i(){ ctx.clearRect(0,0,width,height); random=rand()*0.4*height+0.3*height; q=[{x:0,y:random},{x:0,y:random+height*.15}]; while(q[1].x -1 && u.indexOf('KHTML') == -1, //火狐内核 mobile: !!u.match(/AppleWebKit.*Mobile.*/), //是否为移动终端 ios: !!u.match(/\\(i[^;]+;( U;)? CPU.+Mac OS X/), //ios终端 android: u.indexOf('Android') > -1 || u.indexOf('Linux') > -1, //android终端或者uc浏览器 iPhone: u.indexOf('iPhone') > -1 || u.indexOf('Mac') > -1, //是否为iPhone或者安卓QQ浏览器 iPad: u.indexOf('iPad') > -1, //是否为iPad webApp: u.indexOf('Safari') == -1 ,//是否为web应用程序，没有头部与底部 weixin: u.indexOf('MicroMessenger') == -1 //是否为微信浏览器 }; } var browser ={versions:dev()}; if(browser.versions.mobile === true){ document.ontouchstart = i; }else{ document.onclick = i;} i(); var audio = new Audio(\"solo.mp3\"); function playaudio(){ if(audio.paused){ audio.play(); return; } audio.pause(); } document.onkeydown=function(event){ var e = event || window.event || arguments.callee.caller.arguments[0]; if(e && e.keyCode==80){ // 按 p p=1; } if(e && e.keyCode==73 && p==1){ // 按 i i=1; } if(e && e.keyCode==78 && i==1){ // n 键 n=1; } if(e && e.keyCode==75 && n==1){ // k 键 n=0; i=0; p=0; playaudio(); } if(e && e.keyCode!=80 && e.keyCode!=73 && e.keyCode!=78 && e.keyCode!=75){ n=0; i=0; p=0; } };"},{"title":"Links","date":"2017-02-12T12:19:00.000Z","updated":"2017-04-14T09:44:16.605Z","comments":false,"path":"links/index.html","permalink":"http://21w.space/links/index.html","excerpt":"","text":"MIA一肩月光PINK蔡剑锋"},{"title":"作为人的人存在","date":"2017-04-14T12:25:53.952Z","updated":"2017-04-14T12:24:11.070Z","comments":true,"path":"assets/Top.html","permalink":"http://21w.space/assets/Top.html","excerpt":"","text":""}],"posts":[{"title":"《1844手稿》第三讲","slug":"2017-4-18手稿第三讲","date":"2017-04-19T09:08:47.447Z","updated":"2017-04-19T09:10:25.454Z","comments":true,"path":"2017/04/19/2017-4-18手稿第三讲/","link":"","permalink":"http://21w.space/2017/04/19/2017-4-18手稿第三讲/","excerpt":"","text":"##国民经济学的谎言国民经济学，也就是政治经济学。亚当·斯密——国民经济学之父。 首先，从国民经济学的理论出发，在国民经济学的眼界之中，得出劳动价值规律与工资规律的悖反。 工资决定于资本家与工人之间的敌对斗争。胜利必定属于资本家。劳动与资本的分离对工人来说是致命的。工人要出卖自己和自己人的尊严，只有出卖给谁的自由，没有不出卖的自由，因为工人，只有作为工人才作为人。不管市场供需如何、资本家赢利与否、社会财富增长与否，工人总是不利，贫困持续不变。最终工人获得的工资，实际上只是产品中最小的、没有就不行的部分，也就是说，只得到他不是作为人而是作为工人生存所必要的那一部分以及不是为了繁衍人类而是为繁衍工人这个阶级所必要的那一部分。所以工资规律的结论，工资是维持工人生存及其种群不致死绝的最低花费。 而国民经济学家又告诉我们，劳动的全部产品本来属于工人，资本无非是积累的劳动。“现在让我们站在国民经济学家的立场上，并且仿效他把工人的理论和实践要求比较一下”，从这里开始指出国民经济学自身的矛盾。 资本的原始积累是无法通过资本原则自身获得的。“资本来到世间，从头到脚，每个毛孔都滴着血和肮脏的东西”。西方的是殖民地和鸦片，共和国的是第一代农民。深挖洞广积粮——以战争的名义，低价收取农民粮食。 国民经济学家将资本原则表达为自洽的东西。自洽的方式是——人性本贪、资本竞争。对此，可以考察行会和垄断。行会是行业的自我保护。垄断是无竞争，获得定价权，是竞争的结果。 从“现在让我们超出国民经济学的水平，试以前面几乎是用国民经济学家的原话所作的论述中来回答以下两个问题”开始，以超出国民经济学的眼界讨论。 这两个问题是：1、把人类最大部分归结为抽象劳动，这在人类发展中具有什么意义？2、希望提高工资改善工人阶级状况和把工资平等看作社会革命的目标，犯了什么错误？ 对于第一个问题，劳动抽象化，劳动作为工具和手段出现，而不是作为人的本质出现，这既是进步，又是灾难。 对于第二个问题，提高工资和工资平等都不超出资本原则。马克思说，我们的任务不是提高工资，而是消灭工资。即以扬弃资本原则为目标。 ##一些课堂例子重商主义，是资本原则上升阶段的产物。流通产生价值，要放到历史语境中去理解，当物并未完全进入流通领域，非商品转化为商品，从无到有，自然产生了价值。重农主义是在资本原则取得地位，老贵族阶级与资产阶级谈判的产物。 关于非商品转化为商品。《三峡好人》讲述了三峡移民的故事。从商品价值的眼光看，般迁是件求之不得的事情。而对于原住民来说，土地是祖祖辈辈繁衍生息的地方，是挥洒过汗水、泪水和鲜血的地方，不是待价而沽的商品。 经济学是邪恶的。如果一个人有六个面包，吃一个就饱了，并且每天都会再获得六个。而旁边一个人身无分文，快要饿死了。如果拿着六个面包的人用资本逻辑思考，一个面包值2美元，没有给我2美元交换，不给快要饿死的人面包反而是天经地义的事情。 捐款，实际上是消业，是在为系统正常运行买单。隐性地购买资本原则得以运行的前提。 家庭、市民社会、国家，每一个伦理实体都先于资本。正如一个段子，一个煤老板，花再多钱也无法买到一件事——换掉天安门上的画像。因为他无法购买使这一购买行为得以成立的前提。买卖发生的前提是国家。 市民社会是个翻译的问题，原意是指资产阶级社会。区别于资本主义社会，资本主义社会是资产阶级占统治地位的社会。","categories":[],"tags":[{"name":"马克思","slug":"马克思","permalink":"http://21w.space/tags/马克思/"},{"name":"蔡剑峰","slug":"蔡剑峰","permalink":"http://21w.space/tags/蔡剑峰/"},{"name":"手稿","slug":"手稿","permalink":"http://21w.space/tags/手稿/"}]},{"title":"存在的勇气·第三讲","slug":"2017-4-11存在的勇气·第三讲","date":"2017-04-13T12:55:27.349Z","updated":"2017-04-14T12:19:56.512Z","comments":true,"path":"2017/04/13/2017-4-11存在的勇气·第三讲/","link":"","permalink":"http://21w.space/2017/04/13/2017-4-11存在的勇气·第三讲/","excerpt":"","text":"巴雷特在《存在主义的问世》中总结道，存在主义光谱复杂而性质单一。存在主义，作为一个思想流派，新教徒、犹太人、天主教徒、甚至无神论者等等各种背景的存在主义者，毫无违和地同处其中。他们的思想也各不相同，常见的误解是将某一位存在主义者的思想当作存在主义。比如因为尼采说上帝死了，得出存在主义诞生于超感性世界崩塌之后。或者把存在主义和萨特学派混同，实际上萨特学派只是存在主义极细微的一个片断。单一的性质是，对于存在主义者而言，“宗教的意义及宗教信仰是因人而异的”。个性，始终是存在主义者的关键词。 再谈到萨特，这是由于人们对他过份熟悉，也过份高估。萨特的哲学成就，远远配不上他的社会影响力。海德格尔从来就瞧不上萨特的哲学。当人们把他与萨特同称为存在主义时，海德格尔回应道：如果萨特是存在主义，我就不是。萨特的戏剧，要比他的哲学有价值。萨特的哲学思想：存在先于本质。把存在变成空空的容器，本质是溶液。这个本质指向黑格尔所说：本质，就是作为本质的本质。如评价欧洲反犹传统——反对犹太人的情绪，先于理由。这样说有其合理性，问题在于，对于感性活动来说，把理性的理由拿掉，并非空无内容的容器。 补充关于左派右派的知识。可以用毛泽东的说法，过犹不及，过是左，不及是右。衡量过还是不及的尺度，就是那个占统治地位的思想。西方的左派右派，与中国的有着相反的特性，左派往往有着反政府的一面，右派保守。 关于神学与哲学。在欧洲，没有神学院的大学不能称之为大学。哲学长期是神学院下的一门。很长时间里，哲学作为神学的奴婢存在。哲学的意义成了用理性为神学辩护，因而有理性神学。于是在漫长的中世纪里，思想的进展空乏贫困。中世纪的神学家，严肃讨论的是针尖上站几个天使。听到夜莺美妙的啼叫，转身就讨论要如何杀掉这个恶魔的使者，因为夜莺竟然提供感性的享受。上帝是无质料、超感性的，这种分离从巴门尼德开始——轻的向上重的向下。这一分离同时带来价值的观念，肉体、感性是重的，是向下的，腐败的，堕落的，消极的，灵魂、上帝是轻的，向上的，积极的，高贵的，完美的。用爱情来对比，轻的对应柏拉图式爱情，重的对应有血有肉的活生生的爱情。前者扬弃对象，后者是对象性的存在——“人是受动的存在，因此是有激情的存在”。而神是绝对主动的，因而也是乏味的。灵肉分离是经过漫长的中世纪完成的。 马丁·路德，反对那个教会共同体，却把教会移到每个人的心中，使每个人都变成了僧侣。反对教会不等于反对上帝。 通过与物质的隔离，获得物质的满足。一个青年人，或多或少或早或晚，都是一个斯多葛主义者。追求淡泊，不受外物影响，内在圆满。 尼采说人生最重要的三件事，健康的身体，优雅的外表，通过双手劳动创造财富。要有丰富的生活才能体会这话的重量。 严厉的评价，存在主义者没有一个是健康的，都是病态的。 任何理由都提供一种相反的希望。判断和决断的区别是，前者通过理由得出，后者甚至不需要理由。 存在的勇气，是“不顾一切肯定自我”。这个不顾一切，不是不顾某个具体的事物，而是就其无根据而言。就是在无根据，无法认识的，没有理由的情况下，柏拉图主义者说‘不能’之际，说一句——去你妈的，老子就是要存在。","categories":[],"tags":[{"name":"存在主义","slug":"存在主义","permalink":"http://21w.space/tags/存在主义/"},{"name":"存在的勇气","slug":"存在的勇气","permalink":"http://21w.space/tags/存在的勇气/"},{"name":"蔡剑锋","slug":"蔡剑锋","permalink":"http://21w.space/tags/蔡剑锋/"}]},{"title":"对存在整体发问——读《形而上学导论》","slug":"对存在整体发问","date":"2017-03-31T15:02:18.577Z","updated":"2017-03-31T15:02:09.954Z","comments":true,"path":"2017/03/31/对存在整体发问/","link":"","permalink":"http://21w.space/2017/03/31/对存在整体发问/","excerpt":"","text":"对存在整体发问，即追问诸存在如何存在。 借海德格尔的话说，这是“一切广泛问题中最广泛，一切深刻问题中最深刻的，一切原始问题中最原始的问题”。仅就我而言，这个问题便有很深的渊源。 在我还没有获得地球这一概念时，常常会问这样一个“愚蠢”的问题——大地走到尽头以后是什么样子？说这个问题愚蠢，是因为有着一般常识理性的人都能够回答——地球是圆的，走一圈又会回到原地。这样，这个小孩子的傻问题看似毫无疑义地解决了。然而事实是，问题根本没有得到解答。 因为，当我们思想所及不过是脚下可以起身就去丈量的这片土地的时候，大地所指也就不过是一颗圆状球体上的土地。但当我们看到地球之外的行星、恒星、星系，并思及宇宙的时候，大地自然就指向了宇宙。于是问题自然就成了——宇宙的边界之外是什么？于是我开始拿这个问题问身边的人。这个问题已经很难回答了，因为我们既无法想象一个无边无际的宇宙是什么样子，也无法想象一个有边界的宇宙。但是这也难不倒我们这个时代的聪明人，有人提出多层宇宙、平行宇宙，有人提出更高维的宇宙等等。但如此这般那般回答这个问题的人们，始终没有进入这个问题本身，就好像用地球回答大地尽头一样——不过是把问题推远。 于是，最终我们只能这般发问：“究竟为什么在者在而无反倒不在？”，即对存在整体发问——存在何以存在？ 进入过这种发问状态的人，一定很自然能明白这个问题。于是当我仅读到这一问时，内心就不禁惊呼——就是这个问题！这就是那个如幽灵般萦绕不散的、反反复复将我逼至绝境的、每次进入都恍如重新诞生的问题。 这个问题本身，远比它的答案重要。它逼迫人进入一种发问的状态中。这种发问，乃是作为一切存在中的存在对一切存在之整体的审视。在这种发问中，提问者理所当然地仍归于一切存在之中，同时又不落在一切存在之中。由此，人便完成“一跃”。这“一跃”，既不停留于此岸，又不寻求彼岸。 禅宗讲顿悟，王德峰教授解释说，佛是觉悟者，所谓悟，是与虚无的默契——have a tacit agreement with nothingness。这一“悟”，不正是这“一跃”吗？","categories":[],"tags":[{"name":"哲学","slug":"哲学","permalink":"http://21w.space/tags/哲学/"},{"name":"海德格尔","slug":"海德格尔","permalink":"http://21w.space/tags/海德格尔/"},{"name":"存在","slug":"存在","permalink":"http://21w.space/tags/存在/"}]},{"title":"存在的勇气·第二讲","slug":"2017-3-14存在的勇气·第二讲","date":"2017-03-20T14:21:54.659Z","updated":"2017-04-13T12:57:27.187Z","comments":true,"path":"2017/03/20/2017-3-14存在的勇气·第二讲/","link":"","permalink":"http://21w.space/2017/03/20/2017-3-14存在的勇气·第二讲/","excerpt":"","text":"第二次课继续上次《存在主义的问世》的领读。 黑格尔哲学，虽然在其死后从一种官方正统的地位，一坠而为被一致攻击的目标。甚至由于马克思公开追认黑格尔为自己的老师的缘故，一度在西方国家被限制传播，典型的萨特就缺了这一课。正如被奉为正统的黑格尔哲学并非其真实的鼎盛状态，被攻击与被遗忘也不代表其哲学的消逝。恰恰相反，我们正处在一个那种哲学的时代，黑格尔哲学走出他的书面形式呈现在我们面前。这个时代不需要哲学，因为我们就在那种哲学当中。这里谈到复旦大学哲学系险些被取消的往事，不胜唏嘘。 上次提到了，对黑格尔的批判或者说反对可以分成两条路，存在主义和存在论。然而此两种都有着悲惨的命运，一个被普遍的误解（《哲学家足球赛》改成马克思最后也未能上场就符合这种现实了），一个则只能在边缘化的个人中间流传。这个时候人们普遍需要一种思想，填补巨大的空缺。于是英美原则举着反对那种哲学的口号上场了。然而，英美原则只是高卢日耳曼原则的一个延续罢了。他用一把奥卡姆的剃刀，剃掉了一切“不实用”东西。技术的原则与资本的原则占据了统治地位，而对存在问题则是冷漠的。 关于英美原则的自由平等法制，可以思考巴黎爆炸案巴丢演讲、《自由·平等·博爱》……关于人道，《黑雨》。无人机刺杀…… 希特勒，其实是一次对英美原则的浪漫的反动。这样说可能会被误解成在夸奖希特勒，或为其辩护。但这里的浪漫并非一个褒义词，不能正面现实，不解决问题才称其为浪漫。这次反动的失败，加速了英美原则的扩张。今天的世界，英美原则已经完全确定其统治地位。反映在我们国家，表现为国学的失落。表面看社会上兴起所谓“国学热”，不过是把国学作为精神鸦片一样的东西，疗伤过后继续投入到那种原则中去。诸如此类的事情还有很多，例如时下热门的诗歌大赛，不过是另一个最强大脑罢了，比的是科学知识，跟诗歌没什么关系。 我们越发处于一个被定制的时代，从胎教开始，分毫不容浪费的定制着我们和我们下一代的一生。我们看上去自由，但连穿衣都不自由，一个典型的表现——制服。制服的英文：uniform，统一形式。我们迷信科学技术，以此解决一切问题。而亚马逊网站的推荐算法的例子则告诉我们，机器，借用的是人的判断。 再谈到存在主义进入美国，可以对照80年代初开放的中国。很热，但流于表面。文革中毛完成了两件至关重要的事，一是三个世界理论，一是中美建交，这些为改革开放奠定了基础。开放之后，西方思想一股脑同时进来了，高校之中气氛很活跃，但是不应被高估——生吞活剥了西方文化是当时的注解。生吞活剥是会消化不良的。 宏大的字眼被消解，我们从一个广场时代，进入了菜场时代。每个人守着自己的一个菜摊子叫卖。解构主义，实证主义大行其道。实际上人们普遍处于失语的状态，即不愿意被人代表，也不敢去代表别人。如伽达默尔所言，进入二十一世纪，人们变成有意识的退了出来。 存在主义思潮有其病态的一面。关乎的是个人的存在，甚至拒斥集体与国家。存在主义者表达个人感受，变成基督徒谈论宗教体验一般。但是审美是不等与口味的。人作为类而存在，我们的语言是共同使用的，我们以语言之家为家。 萨特只是存在主义的一面。他是法国社会活动家，社会影响力很大，死时四十万人送行。他的戏剧很好。 反对理性主义，于是退到感性中去。这实际上正是承认了理性主义的原则，把思想的地盘拱手让给自己的对手。 实际上，我们应该“比理性主义者更深刻地思考”。———海德格尔 最后一点时间，我们打开了《存在的勇气》，简短的介绍了作者蒂利希其人。神学家，相较其他存在主义者，理论修养比较深厚。存在主义在哲学中是奇葩，他是特例。","categories":[],"tags":[{"name":"存在主义","slug":"存在主义","permalink":"http://21w.space/tags/存在主义/"},{"name":"存在的勇气","slug":"存在的勇气","permalink":"http://21w.space/tags/存在的勇气/"},{"name":"蔡剑峰","slug":"蔡剑峰","permalink":"http://21w.space/tags/蔡剑峰/"}]},{"title":"磁盘自动同步","slug":"sync&任务计划搭建自动同步","date":"2017-03-05T02:45:24.040Z","updated":"2017-04-14T12:21:09.220Z","comments":true,"path":"2017/03/05/sync&任务计划搭建自动同步/","link":"","permalink":"http://21w.space/2017/03/05/sync&任务计划搭建自动同步/","excerpt":"","text":"但凡对硬盘资料的重要性、硬盘存储的不可靠性及恢复成本的昂贵有所认识，都会将硬盘重要资料备份。备份的方式有很多，常见的百度云，Dropbox等等，可以归为云备份。云备份的优点很多，但在脱网的情况下就完全失效了，而且当前云备份还有很多缺陷。除此以外最好的办法，我认为是本地硬盘备份——比如常备一块移动硬盘或多台计算机互联，保持重要资料同步备份。在适用性方面，我认为云备份是无可比拟的，但在便捷性和安全性方面，还是本地硬盘备份更好。手动方式费时费力，不适应长期工作。所以找到一个便捷可靠的自动备份方案就很重要了。 本文记录使用SyncToy，以及windows系统自带的‘任务计划’ 功能，实现便捷的自动同步——当读取到移动硬盘连入时，自动同步指定文件。也可按此方法类似地实现多种备份。使用系统window10，64位。经过使用发现本方法操作简单，但功能强大。 自动备份软件很多，选用SyncToy的原因：Microsoft推出，可靠，免费，功能简洁，无限制。 首先安装SyncToy。本文采用SyncToy2.1 创建同步方案。创建方案名称为test。定义同步方式（可以选择双向、单向及安全方式三种）。还可以设置过滤参数。SyncToy功能与设置不做赘述。 创建任务计划。插上移动硬盘，在事件查看器中找到对应事件。如图，找到相应事件——右键‘将任务附加到此事件上’——填写名称与描述、下一步、下一步——选择’启动程序’操作、填写启动程序参数——下一步、完成 完成。弹出，重新插入测试，自动完成同步。","categories":[],"tags":[{"name":"SyncToy","slug":"SyncToy","permalink":"http://21w.space/tags/SyncToy/"},{"name":"自动备份","slug":"自动备份","permalink":"http://21w.space/tags/自动备份/"}]},{"title":"《存在的勇气》第一讲-概录","slug":"2017-2-28存在的勇气1","date":"2017-03-01T06:09:04.915Z","updated":"2017-03-20T12:44:33.101Z","comments":true,"path":"2017/03/01/2017-2-28存在的勇气1/","link":"","permalink":"http://21w.space/2017/03/01/2017-2-28存在的勇气1/","excerpt":"","text":"黑格尔要了解存在主义，首先不得不先了解黑格尔。“黑格尔所意指的，不是形而上学之一种，而是形而上学之一切。”（《天津社会科学》，1999年，第6期，《论马克思哲学的当代性》，吴晓明）这里的形而上学，即柏拉图以降的理性主义，整个柏拉图主义。 海涅问：黑格尔先生，难道你就看不到满天的繁星？黑格尔：什么满天繁星，那不过是万里无云的理性天空的疮疤。绝对精神的历史车轮滚滚前进，个人只是沿途无关紧要的花花草草。##出处？## 黑格尔死后，留下巨大的思想空洞，长长的阴影。掀起激烈的反黑格尔思潮，从以读黑格尔、学黑格尔为荣，转变成贬黑格尔为荣。类似遭遇的的人物很多，比如毛泽东。 在后黑格尔时代，反对黑格尔的思想可以归为两个方向。一派即以马克思、海德格尔为代表的生存论（或说存在论、本体论）的方向，一派是存在主义方向。 存在主义推荐存在主义代表作品：《非理性的人》威廉.巴雷特、《存在主义》考夫曼。前者认存在主义之始为陀氏，更注重评论性，后者认为文摘性更强。本课程用《非理性的人》第一章《存在主义的问世》作为存在主义的背景介绍。 克尔凯郭尔（祁克果）。直观感受到现代性的人的无家可归的状态，反抗理性，就像一个叛逆的孩子。连墓志铭都要写上：“那个个体” ，以示对黑格尔的理性的反抗（出处？）。克尔凯郭尔讲过这样一个故事：有一个人对自己的生活从来漫不经心，甚至不知道自己究竟存在还是不存在，结果在一个风和日丽的早晨一觉醒来，他突然发现自己死了。只有在他死的时候，才发现自己的存在。对应流行的”老男孩”，那些年，都是浪漫主义。所谓浪漫主义，就是面对现实问题，向过去逃避，它很感性，很打动人，但不解决实际问题。 死亡。死，是对存在的关切，是哲学的缪斯，是对人有意义的最大的成全。没有思考过死亡的人，“从未遭遇虚无”-王德峰。 &lt;!- “人荒诞地存在在荒诞的存在之中，我们谓之自由的东西，不过是对这种存在的徒劳的探寻”（《灵魂是不能被遮蔽的事物》序言，陈行之）。 –&gt; 陀思妥耶夫斯基。“存在主义之父” 。蔡认为最好的作品《白痴》《被侮辱与被损害》。文学特点，小人物，个性特点，对体制卑微的、失败的、可歌可泣的反抗。存在主义者们就像是从陀氏作品中走出来一样。缺点，独白太多，总是借文学表达自己的思想。陀有一次濒死体验，之后思考：一个人恐惧死亡，到底恐惧的是什么？不是死亡本身，而是那种等待。后期提出，宏大本身就是问题，而不是在左边还是右边。俄国文学的特点，宏大。特例，巴乌斯托夫斯基（也有翻译成帕乌斯托夫斯基），作为俄国文学宏大风格的特例–《雪》。 &lt;!-在这个莫名其妙的世界上，无论怎么叫人发愁，它总还是美丽的……帕乌斯托夫斯基《伊凡·蒲宁》题记 –&gt; 存在主义是失败的浪漫反动，只能归结为一种思潮，是一种类似孩子气的叛逆。存在主义中各个人物思想各不相同，具有个性化的特点。他们的作品极具文采，因为他们正是以感性来反对理性。代表人物有：萨特、加缪、波伏娃。 存在主义的问世《存在主义的问世》实在是总体介绍存在主义极好的文本。以下是一些关键词说明。 理性。日光普照，在西方思想中，指理性。类比中国的月亮，故乡，不是月亮象征故乡，而是看到月亮，看到的就是故乡。 轴心时代，苏格拉底柏拉图、论语孟子，著作都是对话体的形式，离不开语境，这是不同于教材和其他书本的。 现代性。政府的力量，非典，上海，比较。人们趋同，碎片化时间。 对当代的态度，狄更斯，这是最好的时代，这是最坏的时代…… 职业化。profess，表白，带有宗教、信仰意味。profession，职业的，专业性的畸变，狭隘，对超出领域的无视、无知。例子，中马西马，马克思前期晚期，医生我不跟病人以外的人说话，心理医生no relationship，职业教师机械重复。当今的高校，实质是高等职业培训所，以就业率衡量。 总结。面对现实困境的三种解决方式——逃向过去，逃向未来，立足现实。逃向过去，哲学上，卢梭，回归原始社会，浪漫，文采好（休谟，观点争锋相对，但赞叹卢梭的文采；康德，如钟表规律的生活，被卢梭的爱弥儿一文打乱）。逃向未来，乌托邦，把共产主义误解成未来理想社会、乌托邦主义，代表人物弗罗姆。立足现实，马克思。 《非理性的人》存在主义的问世：","categories":[],"tags":[{"name":"存在主义","slug":"存在主义","permalink":"http://21w.space/tags/存在主义/"},{"name":"邝言","slug":"邝言","permalink":"http://21w.space/tags/邝言/"},{"name":"概要","slug":"概要","permalink":"http://21w.space/tags/概要/"}]},{"title":"德意志意识形态课程-导言","slug":"1.导言20160905","date":"2017-02-18T13:27:02.221Z","updated":"2017-03-11T01:36:49.758Z","comments":true,"path":"2017/02/18/1.导言20160905/","link":"","permalink":"http://21w.space/2017/02/18/1.导言20160905/","excerpt":"","text":"录音地址：德意志意识形态课程-导言1 哲学学习的方法学习哲学的两个要点：原著、哲学史，这是哲学学习和理论修养的基本功。没有原著的研读，对哲学的了解是空洞的；而哲学史不是一个名人录，哲学史是线索，是问题展开的历史。在线索中理解每一个发展环节中的代表作品。 引用黄凯向郑中达学说文解字的事例，告诫学习需要下功夫。马克思：科学的道路上就是不平坦的…… 马克思学说–继承和批判马克思学说的主体就是历史唯物主义，不仅是种历史观，而且是存在论。国内国际，真懂历史唯物主义的人寥若晨星。谁算懂的？海德格尔接近了，还是没有真懂，没有抓住历史唯物主义最根本的。他批判马克思，晚年有一个三天讨论班，集中对付马克思《关于费尔巴哈的提纲》。我们可以看到海德格尔还没懂马克思。第十一条，哪一次世界的改变不以对世界的重新理解为前提呢？海德格尔自认为很懂马克思，所以把胡塞尔贬了一下，把萨特贬了一下。我念一段原话，海尔格尔在《关于人道主义的书信》中提到马克思—— “马克思在基本而重要的意义上，从黑格尔那里，作为人的异化认识到的东西，和他的根子一起不归为新时代的人的无家可归的状态。” 这句话他承认马克思从黑格尔那里得到很大启发。马克思的三个来源：黑格尔、费尔巴哈、？（应为德国古典哲学，英国政治经济学，法国革命运动）。究竟从黑格尔那里获得了什么？海德格尔抓住了要点——从黑格尔那里作为人的异化认识到的东西，就是马克思在基本而重要的意义上，把握了异化这件事。但是，这个异化的根子是什么？从人的异化认识到的东西，这个认识到的东西是什么？上下文没有明说。实际上是抽象劳动的主体化。 人力资源，就是典型的人的异化的表现。什么创造了人的异化？——马克思抓住了抽象劳动的主体化。抽象劳动主体化的根子是什么？从海德格尔上下文，他说的这根子就是对世界（对自然界、对人）的技术的态度。新时代指资产阶级时代。 “因为马克思在体会到异化的时候，深入到历史的本质性一度去了” 历史的本质性——历史不仅是一种现象，把历史当作一种现象，也是一种哲学观点，历史的本质性，有谁进去过吗？黑格尔似乎进去过了，黑格尔的辩证逻辑（正反合）是不是进入了历史的本质性，理性自身的正反合的构造就是人类历史过程的根据，所以黑格尔似乎第一次在存在论或本体论中把历史性作为存在性的主题，但还是没有深入到历史的本质性的一度。而海尔格尔在这里承认，马克思在体会到异化的时候，深入到历史的本质的一度中去了。一度或说一维，dimensional。所以马克思关于历史的观点，比其余的历史主义（以往的各种历史理论）优越。 “但因为胡塞尔没有，萨特也没有在存在中认识到历史事物的本质性，所以现象学（胡塞尔）没有，存在主义（萨特）也没有达到这样的一度（历史的本质性的一度）。在此一度中，才有可能有资格和马克思交谈” 这段话很重要，一方面我们体会到海德格尔的眼光，慧眼，但他认为马克思的学说并没有指出一条人类社会摆脱无家可归状态的出路，而且马克思对技术的不断进步的赞扬，在海德格尔看来，还是落到黑格尔哲学的范围，生产概念变成整个历史唯物主义最基本的概念。这个生产概念其实是黑格尔自我意识概念的唯物主义颠倒，没有摆脱近代形而上学。这是对马克思总的批评。当马克思认为生产的进步会为人类的解放准备好物质的基础和各种社会条件的同时，海德格尔认为马克思又回到了无家可归的状态中。所以对马克思比较高明的批判每每抓住的是这个，其他的批判不足道矣。但他们的批判准确与否呢？他们是否抓到了马克思学说本身，归根到底还在生产的逻辑里面——这样一个现代性的本质规定当中去，你还局限于这个本质规定，你在这个本质规定当中居然要指出一条人类解放的道路，这是否可能？现在对马克思批判的要点就在这里。就像波德里亚写的《生产之境》，也就是批评马克思——你的资本论，自称政治经济学批判，其实根本没完成批判，你还是一种政治经济学。这种思想的根据都来自海德格尔对马克思的批评。 我把这个先拿出来的说，就是表明，我们怎么看待对马克思的继承和批判。两种路子，继承的对不对，批判得对不对？到马克思原著中去。马克思在西方思想史上真是个罕见的人物，它普遍的被误解，包括跟他有伟大友谊的恩格斯，一样误解了马克思。恩格斯对马克思的误解是马克思学说的谬误，而这个人物是如此重要，他不断的被误解或曲解，他的影响又是如此巨大。二十世纪每一个哲学流派出现后不久，很快就会出现这种流派跟马克思主义的加集，弗洛伊德的马克思，现象学的马克思，存在主义的马克思，结构主义的马克思等等。分析哲学清晰了是吧，分析的马克思。难怪萨特感慨说，马克思的学说是二十世纪唯一不可超越的学说。马克思也无需我们为他辩护，我们与马克思的关系是，当代人类还需要从马克思那里得到启发，来应对当代问题。伟大思想家的思想，人类要经历几个世纪才能消化吸收，这是叔本华讲的。面对康德伟大的学说，人类就是难以教导的顽童。 需要历史唯物主义启蒙经济学家是资产阶级的学术代表，这是马克思的原话。现在我们觉得这样的命题太过时了，现在我们对社会科学的研究还要阶级分析吗？社会科学有阶级性吗？没阶级性的呀。科学是客观的，价值是中立的，否则他不能叫科学。各位相信这一点吗？MBO 我们中国的社会科学应该完成一次历史唯物主义的启蒙。现今的社会科学建立在沙滩上，这个沙滩叫范畴体系，但这个范畴体系的根基他们不知道。各种科学都是从出发的，社会学有社会学的一系列基本范畴，经济学有经济学的范畴，法学有法学的范畴，有了这些范畴他才获得他的研究领域。比如说，经济学的核心范畴是什么？价值（值多少钱），不是指使用价值，是指交换价值。没有这个价值范畴，就没有经济事实。利润、利息、工资、地租——这些经济范畴都是价值范畴的不同形态。一个杯子，由于赋予了价值属性，它就由单纯的劳动产品转化为了商品。由价值范畴为核心推演出来的一系列范畴，就有了经济学把握人类物质生活关系的基础。所以经济学一定从范畴出发。什么叫经济事实，比如说雇佣劳动，资本家雇佣了一批工人，你用雇佣二字了，就是经济事实了，资本跟雇佣劳动在市场上的关系叫买卖关系，等价交换——我没有拿鞭子逼你劳动。我们在价值范畴中说话，一条事实，雇佣劳动就来了，雇佣劳动是经济事实，但雇佣劳动的本质真相是异化劳动，那就不是经济事实。你把范畴拿掉，把经济范畴清洗掉，你看到的不叫雇佣劳动（雇佣劳动是公平买卖等价交换，工资，交换都在价值范畴里）。我们很快都要到这种经济事实中去了，我跟复旦大学也是处于这个经济事实中，我跟他签过合同，复旦大学是甲方我是乙方，我那多少岗位津贴都标好的，这真叫价值范畴。但我从来不能接受这一点，我认为复旦大学是我的精神家园，复旦培养了我，让我留校加入学术共同体，这是我的领会，它不是一条经济事实对吧。把人类生活世界中的事实，拿范畴框上去，一弄全变成了科学事实，叫社会科学的事实。社会科学就建立在范畴的基础上。而《资本论》不是经济学，因为它是经济范畴之批判的学问。所以我提倡中国社会科学界，应该重新完成一次历史唯物主义的启蒙。 什么叫历史唯物主义？我们打开《哲学的贫困》第二章第一节，马克思在1847年发表的，讲到：“如果有一个英国人把人变成一顶帽子，那么就有德国人把这顶帽子变成观念，这个英国人就是李嘉图，经济学家，这个德国人就是黑格尔。”，一个非常有趣的比喻。本课选读的文本是《德意志意识形态》，书中最要紧的是《关于费尔巴哈的提纲》。什么叫变成帽子——在复旦大学跟我签那个合同的时候它就把我变成了一顶帽子，这个帽子叫做经济范畴。我去民政局之类的部门办一个护照，这个政府机关就要把我变成另外一顶帽子，给我套上一个法学范畴，叫公民。我是市民社会中的一个市民——社会学范畴，又一顶帽子。就把我王德峰变成诸范畴之总和，那这是我吗？当我恋爱的时候遇到情敌，我们战斗，这才是我呢，它没有范畴规定。现在这个也异化了，你有房子吗，你是雇佣劳动者还是企业家。范畴从哪里来？范畴是思维的基本形式，理性就是范畴思维，那么把理性讲得最清楚的是谁——黑格尔，所以就又把范畴变成Idea——理性的观念，所有经济范畴是从理性的怀抱中生长出来。由此这样一个有趣比喻捅开秘密，社会科学的前提近代西方的理性形而上学（主要是黑格尔哲学）。今天的社会学家都不会研究黑格尔，认为他过时了，但是他暗中以黑格尔的理性哲学做前提。怎么叫暗中，说穿了一个普遍的基本信念——比如经济学家认为他们这门学科是科学，因为他们研究的是人类历史发展到这个阶段唯一合理的经济制度，叫资本主义，资本主义之前的制度都是偶然的谬误，对资本主义进行描述就是范畴，这个范畴是非时间的，就是不朽的，于是资本主义也就是不朽的、永恒的。这就是近代理性形而上学的前提，一切社会科学都以这个做前提，他们没有认真的检省过自己的前提，不知道什么叫历史的存在，他们把历史的存在偷换成非时间的存在——范畴规定。 我们进入《德意志意识形态》的阅读，也就是进入历史唯物主义的初创之作。 思想的分娩。相似的有海德格尔、维特根斯坦。 关于《德意志意识形态》著作者的争论，意义优先于考据。 蒲鲁东，《什么是财产》，财产就是盗窃，地位很高。在哲学领域，黑格尔之后有个费尔巴哈，在经济学领域，李嘉图之后有个蒲鲁东。他发现财产关系不是理性的，盗窃是非理性的。但他只停留在这个发现上。 重要材料与概念学习马克思的历史唯物主义有几本重要的书，《1844手稿》，《关于费尔巴哈的提纲》，《德意志意识形态》这是历史唯物主义的源头，《哲学的贫困》——被称为《资本论》真正的导言，为历史唯物主义哲学（马克思称之为真正的哲学）扫清了道路。 生产关系。生产关系不是经济学概念，虽然经济学家也经常用到这个概念，但纯粹是从经济关系的角度理解，对生产关系给予经济学范畴规定就变成经济关系。经济关系拿掉范畴就是生产关系。人类物质生活关系是非理性的，放入范畴，使之成为理性关系。科学就是命题的输入和输出，把人类生活放入范畴（建模），使之成为命题、事实输入。 我们不能轻易贬低经济学，经济学作为逻辑体系拿来描述当代人类经济生活的清晰性是毫无疑问的，但在这个描述中牺牲了生产关系非理性的本质，在生产领域发生的感性冲突无法用理性表达，无法用逻辑消解。 所以终于，马克思的《资本论》揭示了整个资本主义生产系统、经济系统的逻辑上的非自洽性。所以不能把生产关系和经济关系划等号，经济关系是经济学的研究对象，它的前提是范畴关系，范畴与范畴的关系都是理性的。这里的理性指的是西方哲学意义上的理性，即范畴思维，离开范畴谈不上理性。这个跟中国人的理性不一样，你也可以说儒家学说是理性的学说（因为它不是宗教信仰），但这个理性跟西方几千年发展形成的那个理性不是一回事。第一个范畴的发现者——巴门尼德。 经济关系是理性的关系，但生产关系是理性前的关系。生产关系的真正发现者是马克思，此前无论人们口中如何使用生产关系一词，实质上都是经济关系，指的是范畴之间的关系，经济范畴之间的关系就叫经济关系，马克思第一个发现了生产关系。这个例子说明，《德意志意识形态》这个历史唯物主义的开创之作里面用的概念其实都是存在论概念，我们姑且还用概念这个词。 马克思说过，迄今为止的一切生产关系都是对抗性的。我们曾经假设过原始共产主义，未来人类社会叫真正的人类社会，阶级关系没了，生产关系在，但不再具备对抗性。这个对抗性，不是逻辑上的对抗矛盾，而是感性上的对抗，你消灭我或我消灭你，对抗关系是人与人之间感性冲突关系，感性冲突是不可能用逻辑消解的。只有将明明是感性冲突改造成范畴之间的关系，然后讨论逻辑上自洽与否，矛盾与否，即把一个现实中的感性冲突转换为经济学理论研究的任务。转变成理论研究的任务能解决/改变现实中的冲突吗？不可能改变。中国经济能逃得过今天吗，为什么，不是我们没有经济学理性。调整经济结构是社会斗争，social strive，不是理论斗争，理论斗争是观念对抗，不会死人的。大家开会嘛，温文尔雅，发表不同观点，互相商榷就好了。调整经济结构一定要触动既得利益集团——谁动了我的奶酪，马克思看得很清楚。这就是生产关系，经济学家把它变成经济关系，于是马克思在《哲学的贫困》里说“经济关系只是生产关系的理论抽象”。 这些概念看上去是经验性的概念，其实是历史存在论的概念。生产力也是这样。你把生产力直接读成生产工具，读成技术，你又错了。当然包含技术，但是技术也是人与自然界的感性关系，不过它是technology——是人与自然界异化了的感性关系。加入我们用手艺加工自然物，前资本主义阶段手工业劳动者的手艺，它可不是technology，不是技术，所以这种感性关系不是异化的，那叫天人合一，没有把自然界看成是一大堆material，然后我们用我们的概念生出技术来处理它。我们现在就在一个技术的时代，这个技术当然有用，我们看到技术的普遍运用，深入充分渗透到我们的生活中去，我们就是技术至上主义者。这种技术至上的态度不仅是对自然的态度，而且还是对人与人的关系的态度。现代社会组织都以技术的原则加工，比如企业叫管理科学，实际就是技术手段来组织人与人的关系，构成现代企业制度，这全是technology技术。 技术带给我们很多方便，克服许多问题。比如心脏病，可以弄个支架，反正人就是个machine嘛。 中西医是两种自然观。 技术是一种自然观，艺术是另一种自然观。 我们作了一个铺垫性说明，我们读《德意志意识形态》，是在读一本存在论著作，这个存在论叫历史存在论，又名历史唯物主义。因为历史存在论还有别的主义，这是必要的说明。海德格尔的存在论也是历史存在论，但不是历史唯物主义，因为海德格尔的历史存在论讨论的是在，此在，而且是历史性的。而马克思的历史存在论核心概念是social power（社会权力），社会权力的演变，及演变中的辩证法。社会权力的根据都是服从辩证法的，这个辩证法是感性辩证法，不是概念的辩证法，范畴的辩证法。 这一切都是理解上的准备。","categories":[],"tags":[{"name":"马克思","slug":"马克思","permalink":"http://21w.space/tags/马克思/"},{"name":"王德峰","slug":"王德峰","permalink":"http://21w.space/tags/王德峰/"}]},{"title":"成长的感知及其他","slug":"2017-02-11成长的感知及其他","date":"2017-02-10T16:00:00.000Z","updated":"2017-03-03T03:15:27.066Z","comments":true,"path":"2017/02/11/2017-02-11成长的感知及其他/","link":"","permalink":"http://21w.space/2017/02/11/2017-02-11成长的感知及其他/","excerpt":"","text":"大概在去年十月份，一边学着JS，一边把这个博客搭好。 解决许多未知的问题的过程中，体会到作为人有所可为的喜悦。同时感到知之甚少，能力有限。 在短暂的喜悦过后，觉得博客还大有完善的余地。比如毕竟还是用的别人的主题，是不是可以自己做一个主题呢？再进一步，对于Hexo是不是也可以搞点事情，要不要也朝着自己做一个的方向努力一下？ 这么一考虑之后，觉得这个博客简直有些让自己蒙羞了。最后主题没做出来，Hexo在更远处，博客也尘封起来。 回顾这个过程，其实能有很多收获。 对我来说，做出这个博客，是一个提高。而在这个领域里，这点提高又不值一提。从这个领域的角度来看，这个提高竟无法再让我感到快乐。 我想这可能是阻碍人持续提高的一个主要原因吧—不能为自己的一点点成长感到兴奋和激动，无法从成长的快乐里获得激励，也就没有持续成长的动力。 回想起以前囚徒健身的心得，还没有扩展到其他的领域。当时体会到每一个简单的动作都应该认真完成，“要榨干每个动作的养分”。真正遇到其他领域的问题，又开始急进浮躁。技术的精进，应该从一点点小的提高中，吸足养分。成长的每一件小事，也应该认真对待，榨干养分。 最近朋友推荐李笑来的文章，细读了一篇关于“感受细微变化的能力”和“元认知”的文章。其实，跟冥想以及健身都相通，又觉得新有一些领悟。 感知能力，实在是再重要不过的能力。事物并不主动呈现，而是在人的感知下一同明了起来。（王阳明《传习录》）美与否、丰富与否、快乐与否，都不能脱离感知能力而自在自为。看看《Rick and morty》里的爸爸，就知道感知能力低下是怎样。外星人把他放到模拟装置里，模拟出现实世界的样子。后来他们把配置降到最低，人物与环境已经出离的异常了，可怜的爸爸依然发现不了。这是一种表现手法，实际上却是现代人的普遍的状态。在川流的东京或上海市中心的街道上，形色匆匆的人们关心身边的人和物吗？ 不过这种感知，还是直观的。于是联想到感性活动。在听王德峰教授讲马克思之前，没有感性活动的概念。技术迷信的人就是认识不到感性活动的存在，或者将其与客观精神（黑格尔）二元地看待。因而将科学知识当作世界本身——自然乃诸范畴之总和，进而认为万事万物，包括人都可以被数字化。不会理解为什么说今天的科学，就是中世纪的基督教，而只当一切对科学流露异见的人不懂科学—即科学的异教徒。没有感性活动的人就是电影《黑客帝国》的矩阵里的人类，就是缸中脑，其实从来都没有真正来过这个世界。 对于一个苹果，有无数相关的知识。一张这个苹果的照片、一个三维建模、甚至扫描3D打印出一个“苹果”，它的几何学的所有描述，它的重量、颜色、温度、硬度，它的元素构成，它的组织结构、细胞、基因，它的植物学属、种、类等等。所有这些可数字化的关于那个苹果的科学知识，加在一起，也加不出这个现实的此在的（海德格尔，一个与意识领域不同的领域）苹果。 “信息科学的语言的基本特点是，用简化分析中的一切数据搭建一个新的、简直就是贫乏的结构”（《晚期海德格尔的三天讨论班纪要》丁耕）用科学中的建模的方法，理解自然和人。所谓管理学，就是在企业中对人的简化建模，将人转换成职员进行组织管理。在这种前提之下，所谓的人性化管理，以人为本，不过就是一种虚伪的改良。就如同有人提出，我们再新建一些学科，添加更多的知识范畴，积累更多的数据，就能构造出那个苹果了。但我们都知道，这并不改变其贫乏的本质。","categories":[],"tags":[{"name":"感知","slug":"感知","permalink":"http://21w.space/tags/感知/"},{"name":"感性活动","slug":"感性活动","permalink":"http://21w.space/tags/感性活动/"},{"name":"成长","slug":"成长","permalink":"http://21w.space/tags/成长/"}]},{"title":"山西记","slug":"2017-02-10山西记","date":"2017-02-10T12:41:16.251Z","updated":"2017-02-11T03:25:43.931Z","comments":true,"path":"2017/02/10/2017-02-10山西记/","link":"","permalink":"http://21w.space/2017/02/10/2017-02-10山西记/","excerpt":"抒情越来越不合时宜，时间越来越快。这个问题越来越意味深长：人为什么要追求效率。不追求效率，人可以追求什么？","text":"抒情越来越不合时宜，时间越来越快。这个问题越来越意味深长：人为什么要追求效率。不追求效率，人可以追求什么？ 来这里四个月了，夏末将至冬末。 厂外田地里的高粱和玉米长熟了、收割了，然后放养牛羊，如今坦露着干枯的刚翻耕过的土地。 土地，面对它，想起那首诗。“放弃沉思和智慧，如果不能带来麦粒，请对诚实的大地，保持沉默。”（海子《重建家园》） 愿你也一样，依然饱含对土地的深情和崇敬。 已经爬过这个室外楼梯许多遍，钢制结构，阳光照着，洁白如雪。从楼梯上能看到远处的山和夕阳，那是山西诗一样的山和酒一样的夕阳，看上去永远是一幅多彩而壮丽的画。 尤其动人的，天晴时没有一丝云的痕迹，天空澄净旷远。日光底下走一走，感受得到一切的美好。所谓过往不念，未来不期，正是此时此刻此地，美到无暇他顾，觉得其他一切都是小事。 已经吃惯了这里粗厚的面条，习惯了吃饭倒一小碟醋，每一顿总也离不开烩菜，更是对这里不羁的服务员们习以为常，还有山西特色的反问语调。到他乡旅游几日，和生活几个月截然不同，后者才能真正以面对生活的态度面对那里的林林总总，方能品尝出一处山水一处生活的滋味。 从书本上读到汉文明发源地在哪里，终究只是几个符号组成的一句话，一个知识点。在这里看到遍地的古迹，意识到自己的祖辈就在这片土地上出生、劳动、出走。听当地人讲大槐树，讲貂蝉的时候，会突然意识到充斥自己生活的只有资本与技术原则，空洞乏味，人们只会讲钱房车,讲那个似乎展开着的未来。再看这片土地，能看到眼睛所看不到的东西，人的生生世世，民族命运的悲喜。 在这又一个精神与时间的房子里，经历着想要放弃生命的难过，与欢喜宁静自得自足，反反复复。时而哼着歌，蹦蹦跳跳，时而痛苦得叫了出来。可怜的自我折磨的灵魂，同时又自得其乐。 在这个房子里的一切，都留在了房子里。兴致勃勃地做了自己的博客，做了一个用来表白的精美网页，最后又都留在这个房子里。没日没夜的看康德和马克思，为一点理解而欢喜，为理解无能而痛苦，也都留在了这个房子里。 这个房子就是我，喜与悲，终究困在我之内。关于我，总是在自我拷问，总是哑口无言，无法回答。 和上次与之前的每一次一样，一个人来，一个人生活，一个人离开。没有故乡或异乡，只有精神与时间的房子、将离之地和将往之地。","categories":[],"tags":[{"name":"行记","slug":"行记","permalink":"http://21w.space/tags/行记/"},{"name":"山西","slug":"山西","permalink":"http://21w.space/tags/山西/"}]},{"title":"重装系统后的博客系统恢复","slug":"重装系统后的博客系统恢复","date":"2017-02-08T13:22:06.863Z","updated":"2017-02-08T14:32:18.794Z","comments":true,"path":"2017/02/08/重装系统后的博客系统恢复/","link":"","permalink":"http://21w.space/2017/02/08/重装系统后的博客系统恢复/","excerpt":"之前乱进网站，电脑中毒了，Chrome浏览器启动程序被篡改，主页挟持。小胳膊拧不过大腿，无奈重装。 重装后博客系统的恢复一直搁置，直到今天花了一个小时搞定，比想象中要顺利。","text":"之前乱进网站，电脑中毒了，Chrome浏览器启动程序被篡改，主页挟持。小胳膊拧不过大腿，无奈重装。 重装后博客系统的恢复一直搁置，直到今天花了一个小时搞定，比想象中要顺利。 1、首先安装Github，因为之前有离线安装包，重新安装十分方便。安装好后登陆Github账号即可。2、重新安装node.js node -vnpm -v检查node.js环境安装成功 3、重新安装hexonpm install hexo-cli -gnpm install hexo –savehexo -v重新安装hexo，及检查 hexo init初始化 npm install安装需要的组件 将原有备份的hexo文件夹中，themes 、sources文件夹及_config.yml文件移至新文件夹 hexo d 发布遇到错误提示：ERROR Deployer not found: Git解决办法：输入npm install hexo-deployer-git –save hexo d 发布遇到错误提示：FATAL fatal: Not a git repository (or any of the parent directories): .git解决办法：git init 生成一个.git隐藏文件夹，将这个文件夹移至.deploy_git文件夹，发布成功。","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://21w.space/tags/hexo/"},{"name":"github","slug":"github","permalink":"http://21w.space/tags/github/"}]},{"title":"博客搭建过程","slug":"博客搭建","date":"2016-11-04T10:35:02.477Z","updated":"2016-11-05T10:59:57.113Z","comments":true,"path":"2016/11/04/博客搭建/","link":"","permalink":"http://21w.space/2016/11/04/博客搭建/","excerpt":"","text":"Nodejs &amp; Gitnodejs 可以很方便下载安装. git 由于服务器原因,安装包无法下载成功,github 桌面版同样如此.幸而找到 github离线包 安装github桌面版可以省去设置 1.ssh 2.用户名和邮箱 github 桌面端 setting 中可以将 default shell 改成 git bash . Hexosource 文件夹中可以根据需要添加东西,比如 CNAME . 本地测试 http://localhost:4000/ hexo根目录下 _config.yml 和主题包下 _config.yml 要区分 域名这个域名很便宜 SSH 测试遇到的问题12$ ssh -T git@github.comssh_exchange_identification: read: Connection reset by peer 参考 ssh 排错经验用 ssh -v 测试 123456789101112$ ssh -v git@github.comOpenSSH_6.6.1, OpenSSL 1.0.1i 6 Aug 2014debug1: Reading configuration data /etc/ssh/ssh_configdebug1: /etc/ssh/ssh_config line 1: Applying options for *debug1: /etc/ssh/ssh_config line 5: Applying options for github.comdebug1: Connecting to github.com [192.30.253.113] port 22.debug1: Connection established.debug1: identity file /c/Users/L/.ssh/github_rsa type 1debug1: identity file /c/Users/L/.ssh/github_rsa-cert type -1debug1: Enabling compatibility mode for protocol 2.0debug1: Local version string SSH-2.0-OpenSSH_6.6.1ssh_exchange_identification: read: Connection reset by peer 可以判断是服务器出了问题.搭梯子:123$ ssh -T git@github.comWarning: Permanently added &apos;github.com,192.30.253.112&apos; (RSA) to the list of known hosts.Hi username! You&apos;ve successfully authenticated, but GitHub does not provide shell access. 毕竟小白,实际过程艰辛感人. 比如因为 SSH 的问题把所有软件重新装了一遍. 参考资料主要参考:史上最详细的Hexo博客搭建图文教程Windows搭建自己的独立博客","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://21w.space/tags/hexo/"},{"name":"github","slug":"github","permalink":"http://21w.space/tags/github/"}]}]}